#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Hero_1036

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Marvel_structs.hpp"
#include "Marvel_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Hero_1036_structs.hpp"


namespace SDK
{

// Class Hero_1036.AbilityStatistics_103641
// 0x0000 (0x0088 - 0x0088)
class UAbilityStatistics_103641 final : public UTagAbilityStatistics
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilityStatistics_103641">();
	}
	static class UAbilityStatistics_103641* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityStatistics_103641>();
	}
};
//(alignof(UAbilityStatistics_103641) == 0x000008, "Wrong alignment on UAbilityStatistics_103641");
//(sizeof(UAbilityStatistics_103641) == 0x000088, "Wrong size on UAbilityStatistics_103641");

// Class Hero_1036.Config_103601
// 0x0008 (0x00C8 - 0x00C0)
class UConfig_103601 final : public UMarvelAbilityConfig_DoubleJump
{
public:
	float                                         HorizonDeceleration;                               // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeToEnterBreak;                                  // 0x00C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Config_103601">();
	}
	static class UConfig_103601* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConfig_103601>();
	}
};
//(alignof(UConfig_103601) == 0x000008, "Wrong alignment on UConfig_103601");
//(sizeof(UConfig_103601) == 0x0000C8, "Wrong size on UConfig_103601");
//(offsetof(UConfig_103601, HorizonDeceleration) == 0x0000C0, "Member 'UConfig_103601::HorizonDeceleration' has a wrong offset!");
//(offsetof(UConfig_103601, TimeToEnterBreak) == 0x0000C4, "Member 'UConfig_103601::TimeToEnterBreak' has a wrong offset!");

// Class Hero_1036.Ability_103601
// 0x0020 (0x2668 - 0x2648)
class UAbility_103601 : public UMarvelAbility_DoubleJump
{
public:
	class UConfig_103601*                         Config103601;                                      // 0x2648(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2650[0x18];                                    // 0x2650(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DecelerationLaunchVel(float DeltaTime, const struct FVector& OldLocation, const struct FVector& OldVelocity);
	void OnTimeToEnterBreak();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Ability_103601">();
	}
	static class UAbility_103601* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbility_103601>();
	}
};
//(alignof(UAbility_103601) == 0x000008, "Wrong alignment on UAbility_103601");
//(sizeof(UAbility_103601) == 0x002668, "Wrong size on UAbility_103601");
//(offsetof(UAbility_103601, Config103601) == 0x002648, "Member 'UAbility_103601::Config103601' has a wrong offset!");

// Class Hero_1036.ChangeGravityAbility_103601
// 0x0000 (0x11A0 - 0x11A0)
class UChangeGravityAbility_103601 : public UMarvelChangeGravityAbility
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ChangeGravityAbility_103601">();
	}
	static class UChangeGravityAbility_103601* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChangeGravityAbility_103601>();
	}
};
//(alignof(UChangeGravityAbility_103601) == 0x000008, "Wrong alignment on UChangeGravityAbility_103601");
//(sizeof(UChangeGravityAbility_103601) == 0x0011A0, "Wrong size on UChangeGravityAbility_103601");

// Class Hero_1036.Config_103614
// 0x0008 (0x00A0 - 0x0098)
class UConfig_103614 : public UMarvelAbilityConfig
{
public:
	float                                         DistanceToPlayRecoverAnim;                         // 0x0098(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Config_103614">();
	}
	static class UConfig_103614* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConfig_103614>();
	}
};
//(alignof(UConfig_103614) == 0x000008, "Wrong alignment on UConfig_103614");
//(sizeof(UConfig_103614) == 0x0000A0, "Wrong size on UConfig_103614");
//(offsetof(UConfig_103614, DistanceToPlayRecoverAnim) == 0x000098, "Member 'UConfig_103614::DistanceToPlayRecoverAnim' has a wrong offset!");

// Class Hero_1036.Ability_103614
// 0x0020 (0x2570 - 0x2550)
class UAbility_103614 : public UMarvelGameplayAbility
{
public:
	class AActor*                                 TargetActor;                                       // 0x2550(0x0008)(BlueprintVisible, Net, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ClientKnockUpDir;                                  // 0x2558(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void K2_ReadyToRecovery();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Ability_103614">();
	}
	static class UAbility_103614* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbility_103614>();
	}
};
//(alignof(UAbility_103614) == 0x000008, "Wrong alignment on UAbility_103614");
//(sizeof(UAbility_103614) == 0x002570, "Wrong size on UAbility_103614");
//(offsetof(UAbility_103614, TargetActor) == 0x002550, "Member 'UAbility_103614::TargetActor' has a wrong offset!");
//(offsetof(UAbility_103614, ClientKnockUpDir) == 0x002558, "Member 'UAbility_103614::ClientKnockUpDir' has a wrong offset!");

// Class Hero_1036.KnockUp_103614
// 0x0000 (0x1D50 - 0x1D50)
class UKnockUp_103614 final : public UMarvelKnockUpAbility
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"KnockUp_103614">();
	}
	static class UKnockUp_103614* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKnockUp_103614>();
	}
};
//(alignof(UKnockUp_103614) == 0x000008, "Wrong alignment on UKnockUp_103614");
//(sizeof(UKnockUp_103614) == 0x001D50, "Wrong size on UKnockUp_103614");

// Class Hero_1036.Summoned_10362101
// 0x0000 (0x0800 - 0x0800)
class ASummoned_10362101 final : public AMarvelSummonerBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Summoned_10362101">();
	}
	static class ASummoned_10362101* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASummoned_10362101>();
	}
};
//(alignof(ASummoned_10362101) == 0x000010, "Wrong alignment on ASummoned_10362101");
//(sizeof(ASummoned_10362101) == 0x000800, "Wrong size on ASummoned_10362101");

// Class Hero_1036.Cue_Summoner_Loop_10362101
// 0x0000 (0x0E30 - 0x0E30)
class ACue_Summoner_Loop_10362101 : public AMarvelCueNotify_Summoned
{
public:
	void InitializeSpiderWebDecal(class USpiderWebDecalComponent* InSpiderWebDecalComponent);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Cue_Summoner_Loop_10362101">();
	}
	static class ACue_Summoner_Loop_10362101* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACue_Summoner_Loop_10362101>();
	}
};
//(alignof(ACue_Summoner_Loop_10362101) == 0x000008, "Wrong alignment on ACue_Summoner_Loop_10362101");
//(sizeof(ACue_Summoner_Loop_10362101) == 0x000E30, "Wrong size on ACue_Summoner_Loop_10362101");

// Class Hero_1036.EffectAbility_10362111
// 0x0018 (0x1100 - 0x10E8)
class UEffectAbility_10362111 : public UMarvelEffectGameplayAbility
{
public:
	TArray<int32>                                 DetonableScopeIDs;                                 // 0x10E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         BuffIDToApply;                                     // 0x10F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10FC[0x4];                                     // 0x10FC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnDamageTaken(class AActor* SourceAvatar, class AActor* TargetAvatar, const struct FAttributeModifierHandle& ModifierParameterHandle);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EffectAbility_10362111">();
	}
	static class UEffectAbility_10362111* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEffectAbility_10362111>();
	}
};
//(alignof(UEffectAbility_10362111) == 0x000008, "Wrong alignment on UEffectAbility_10362111");
//(sizeof(UEffectAbility_10362111) == 0x001100, "Wrong size on UEffectAbility_10362111");
//(offsetof(UEffectAbility_10362111, DetonableScopeIDs) == 0x0010E8, "Member 'UEffectAbility_10362111::DetonableScopeIDs' has a wrong offset!");
//(offsetof(UEffectAbility_10362111, BuffIDToApply) == 0x0010F8, "Member 'UEffectAbility_10362111::BuffIDToApply' has a wrong offset!");

// Class Hero_1036.Config_103631
// 0x0178 (0x0210 - 0x0098)
class UConfig_103631 final : public UMarvelAbilityConfig
{
public:
	bool                                          bUseInteractableActor;                             // 0x0098(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPhysicsWeaponPossessInfos             PossessInfos;                                      // 0x00A0(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	int32                                         SummonerProjectileId;                              // 0x00F0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DizzyBuffId;                                       // 0x00F4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DragBuffId;                                        // 0x00F8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DelayTimeToDrag;                                   // 0x00FC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DelayTimeToRemoveDizzyBuff;                        // 0x0100(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           CameraCueTag;                                      // 0x0104(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CameraCueDuration;                                 // 0x0110(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMarvelGameplayTagRequirements         CameraCueTagRequirements;                          // 0x0118(0x00D0)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class UCurveFloat*                            YawCurve;                                          // 0x01E8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   HandSocketName;                                    // 0x01F0(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            LengthCurve;                                       // 0x0200(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            ZBiasCurve;                                        // 0x0208(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Config_103631">();
	}
	static class UConfig_103631* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConfig_103631>();
	}
};
//(alignof(UConfig_103631) == 0x000008, "Wrong alignment on UConfig_103631");
//(sizeof(UConfig_103631) == 0x000210, "Wrong size on UConfig_103631");
//(offsetof(UConfig_103631, bUseInteractableActor) == 0x000098, "Member 'UConfig_103631::bUseInteractableActor' has a wrong offset!");
//(offsetof(UConfig_103631, PossessInfos) == 0x0000A0, "Member 'UConfig_103631::PossessInfos' has a wrong offset!");
//(offsetof(UConfig_103631, SummonerProjectileId) == 0x0000F0, "Member 'UConfig_103631::SummonerProjectileId' has a wrong offset!");
//(offsetof(UConfig_103631, DizzyBuffId) == 0x0000F4, "Member 'UConfig_103631::DizzyBuffId' has a wrong offset!");
//(offsetof(UConfig_103631, DragBuffId) == 0x0000F8, "Member 'UConfig_103631::DragBuffId' has a wrong offset!");
//(offsetof(UConfig_103631, DelayTimeToDrag) == 0x0000FC, "Member 'UConfig_103631::DelayTimeToDrag' has a wrong offset!");
//(offsetof(UConfig_103631, DelayTimeToRemoveDizzyBuff) == 0x000100, "Member 'UConfig_103631::DelayTimeToRemoveDizzyBuff' has a wrong offset!");
//(offsetof(UConfig_103631, CameraCueTag) == 0x000104, "Member 'UConfig_103631::CameraCueTag' has a wrong offset!");
//(offsetof(UConfig_103631, CameraCueDuration) == 0x000110, "Member 'UConfig_103631::CameraCueDuration' has a wrong offset!");
//(offsetof(UConfig_103631, CameraCueTagRequirements) == 0x000118, "Member 'UConfig_103631::CameraCueTagRequirements' has a wrong offset!");
//(offsetof(UConfig_103631, YawCurve) == 0x0001E8, "Member 'UConfig_103631::YawCurve' has a wrong offset!");
//(offsetof(UConfig_103631, HandSocketName) == 0x0001F0, "Member 'UConfig_103631::HandSocketName' has a wrong offset!");
//(offsetof(UConfig_103631, LengthCurve) == 0x000200, "Member 'UConfig_103631::LengthCurve' has a wrong offset!");
//(offsetof(UConfig_103631, ZBiasCurve) == 0x000208, "Member 'UConfig_103631::ZBiasCurve' has a wrong offset!");

// Class Hero_1036.Ability_103631
// 0x0208 (0x2758 - 0x2550)
class UAbility_103631 : public UMarvelGameplayAbility
{
public:
	class UPhysicalInteractionComponent*          PhysicalInteractionComponent;                      // 0x2550(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ACharacter*                             TargetCharacter;                                   // 0x2558(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             ProjectileHitDelegate;                             // 0x2560(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class AMarvelAbilityTargetActor_Projectile*   ProjectileSpawned;                                 // 0x2570(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             HitResultReplicated;                               // 0x2578(0x0160)(Net, Transient, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class UConfig_103631*                         Config;                                            // 0x26D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AMarvelBaseCharacter*                   OwnerCharacter;                                    // 0x26E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMarvelAbilityTask_PlayMontageAndWaitForEvent* PlayMontageTask;                                   // 0x26E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnStatusChanged;                                   // 0x26F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_2700[0x58];                                    // 0x2700(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ApplyDragBuff();
	void ClientRPCJumpToSection(class FName SectionName);
	void ClientRPCTargetDashFinish();
	bool GetHitResultReplicated(struct FHitResult* OutHitResult, bool* OutIsCharacter, bool* OutIsSummoner);
	void OnAbilityHit(const struct FHitResult& HitResult);
	void OnServerTargetDashFinish(EDashStopReason Reason);
	void RemoveCameraCue();
	void RemoveDizzyBuff();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Ability_103631">();
	}
	static class UAbility_103631* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbility_103631>();
	}
};
//(alignof(UAbility_103631) == 0x000008, "Wrong alignment on UAbility_103631");
//(sizeof(UAbility_103631) == 0x002758, "Wrong size on UAbility_103631");
//(offsetof(UAbility_103631, PhysicalInteractionComponent) == 0x002550, "Member 'UAbility_103631::PhysicalInteractionComponent' has a wrong offset!");
//(offsetof(UAbility_103631, TargetCharacter) == 0x002558, "Member 'UAbility_103631::TargetCharacter' has a wrong offset!");
//(offsetof(UAbility_103631, ProjectileHitDelegate) == 0x002560, "Member 'UAbility_103631::ProjectileHitDelegate' has a wrong offset!");
//(offsetof(UAbility_103631, ProjectileSpawned) == 0x002570, "Member 'UAbility_103631::ProjectileSpawned' has a wrong offset!");
//(offsetof(UAbility_103631, HitResultReplicated) == 0x002578, "Member 'UAbility_103631::HitResultReplicated' has a wrong offset!");
//(offsetof(UAbility_103631, Config) == 0x0026D8, "Member 'UAbility_103631::Config' has a wrong offset!");
//(offsetof(UAbility_103631, OwnerCharacter) == 0x0026E0, "Member 'UAbility_103631::OwnerCharacter' has a wrong offset!");
//(offsetof(UAbility_103631, PlayMontageTask) == 0x0026E8, "Member 'UAbility_103631::PlayMontageTask' has a wrong offset!");
//(offsetof(UAbility_103631, OnStatusChanged) == 0x0026F0, "Member 'UAbility_103631::OnStatusChanged' has a wrong offset!");

// Class Hero_1036.Projectile_10363101
// 0x0000 (0x2F60 - 0x2F60)
class AProjectile_10363101 final : public AMarvelAbilityTargetActor_Projectile
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Projectile_10363101">();
	}
	static class AProjectile_10363101* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProjectile_10363101>();
	}
};
//(alignof(AProjectile_10363101) == 0x000010, "Wrong alignment on AProjectile_10363101");
//(sizeof(AProjectile_10363101) == 0x002F60, "Wrong size on AProjectile_10363101");

// Class Hero_1036.TraceComponent_10363102
// 0x0010 (0x16C0 - 0x16B0)
class UTraceComponent_10363102 final : public UMarvelAgentTraceComponent
{
public:
	uint8                                         Pad_16A8[0x18];                                    // 0x16A8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TraceComponent_10363102">();
	}
	static class UTraceComponent_10363102* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTraceComponent_10363102>();
	}
};
//(alignof(UTraceComponent_10363102) == 0x000010, "Wrong alignment on UTraceComponent_10363102");
//(sizeof(UTraceComponent_10363102) == 0x0016C0, "Wrong size on UTraceComponent_10363102");

// Class Hero_1036.DragAbility_103631
// 0x0008 (0x1CA8 - 0x1CA0)
class UDragAbility_103631 : public UMarvelDragAbility
{
public:
	bool                                          bOnEndEffectEndOwnerAbility;                       // 0x1CA0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CA1[0x7];                                     // 0x1CA1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DragAbility_103631">();
	}
	static class UDragAbility_103631* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDragAbility_103631>();
	}
};
//(alignof(UDragAbility_103631) == 0x000008, "Wrong alignment on UDragAbility_103631");
//(sizeof(UDragAbility_103631) == 0x001CA8, "Wrong size on UDragAbility_103631");
//(offsetof(UDragAbility_103631, bOnEndEffectEndOwnerAbility) == 0x001CA0, "Member 'UDragAbility_103631::bOnEndEffectEndOwnerAbility' has a wrong offset!");

// Class Hero_1036.MarvelTurnCharacterAndCameraAbility_103631
// 0x0020 (0x1108 - 0x10E8)
class UMarvelTurnCharacterAndCameraAbility_103631 : public UMarvelEffectGameplayAbility
{
public:
	struct FRotator                               MyTargetRotator;                                   // 0x10E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         InterpSpeed;                                       // 0x1100(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1104[0x4];                                     // 0x1104(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MarvelTurnCharacterAndCameraAbility_103631">();
	}
	static class UMarvelTurnCharacterAndCameraAbility_103631* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMarvelTurnCharacterAndCameraAbility_103631>();
	}
};
//(alignof(UMarvelTurnCharacterAndCameraAbility_103631) == 0x000008, "Wrong alignment on UMarvelTurnCharacterAndCameraAbility_103631");
//(sizeof(UMarvelTurnCharacterAndCameraAbility_103631) == 0x001108, "Wrong size on UMarvelTurnCharacterAndCameraAbility_103631");
//(offsetof(UMarvelTurnCharacterAndCameraAbility_103631, MyTargetRotator) == 0x0010E8, "Member 'UMarvelTurnCharacterAndCameraAbility_103631::MyTargetRotator' has a wrong offset!");
//(offsetof(UMarvelTurnCharacterAndCameraAbility_103631, InterpSpeed) == 0x001100, "Member 'UMarvelTurnCharacterAndCameraAbility_103631::InterpSpeed' has a wrong offset!");

// Class Hero_1036.Cue_Buff_10363102
// 0x0020 (0x1008 - 0x0FE8)
class ACue_Buff_10363102 final : public AMarvelCueNotify_Buff
{
public:
	struct FVector                                DirectionW;                                        // 0x0FE8(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraComponent*                      NiagaraLoopFX;                                     // 0x1000(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Cue_Buff_10363102">();
	}
	static class ACue_Buff_10363102* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACue_Buff_10363102>();
	}
};
//(alignof(ACue_Buff_10363102) == 0x000008, "Wrong alignment on ACue_Buff_10363102");
//(sizeof(ACue_Buff_10363102) == 0x001008, "Wrong size on ACue_Buff_10363102");
//(offsetof(ACue_Buff_10363102, DirectionW) == 0x000FE8, "Member 'ACue_Buff_10363102::DirectionW' has a wrong offset!");
//(offsetof(ACue_Buff_10363102, NiagaraLoopFX) == 0x001000, "Member 'ACue_Buff_10363102::NiagaraLoopFX' has a wrong offset!");

// Class Hero_1036.Config_103651
// 0x0018 (0x00B0 - 0x0098)
class UConfig_103651 final : public UMarvelAbilityConfig
{
public:
	int32                                         SlowDownBuffId;                                    // 0x0098(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            SlowdownCurve;                                     // 0x00A0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableMeshHit;                                     // 0x00A8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Config_103651">();
	}
	static class UConfig_103651* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConfig_103651>();
	}
};
//(alignof(UConfig_103651) == 0x000008, "Wrong alignment on UConfig_103651");
//(sizeof(UConfig_103651) == 0x0000B0, "Wrong size on UConfig_103651");
//(offsetof(UConfig_103651, SlowDownBuffId) == 0x000098, "Member 'UConfig_103651::SlowDownBuffId' has a wrong offset!");
//(offsetof(UConfig_103651, SlowdownCurve) == 0x0000A0, "Member 'UConfig_103651::SlowdownCurve' has a wrong offset!");
//(offsetof(UConfig_103651, EnableMeshHit) == 0x0000A8, "Member 'UConfig_103651::EnableMeshHit' has a wrong offset!");

// Class Hero_1036.Ability_103651
// 0x0010 (0x2568 - 0x2558)
class UAbility_103651 : public UAbility_108
{
public:
	FMulticastInlineDelegateProperty_             SlowDownDelegate;                                  // 0x2558(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Ability_103651">();
	}
	static class UAbility_103651* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbility_103651>();
	}
};
//(alignof(UAbility_103651) == 0x000008, "Wrong alignment on UAbility_103651");
//(sizeof(UAbility_103651) == 0x002568, "Wrong size on UAbility_103651");
//(offsetof(UAbility_103651, SlowDownDelegate) == 0x002558, "Member 'UAbility_103651::SlowDownDelegate' has a wrong offset!");

// Class Hero_1036.TraceComponent_10365101
// 0x0000 (0x16B0 - 0x16B0)
class UTraceComponent_10365101 final : public UMarvelAgentTraceComponent
{
public:
	class UConfig_103651*                         Config;                                            // 0x16A8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void OnScopeTraceResults(class UObject* TraceSource, const TArray<struct FHitResult>& HitResults);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TraceComponent_10365101">();
	}
	static class UTraceComponent_10365101* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTraceComponent_10365101>();
	}
};
//(alignof(UTraceComponent_10365101) == 0x000010, "Wrong alignment on UTraceComponent_10365101");
//(sizeof(UTraceComponent_10365101) == 0x0016B0, "Wrong size on UTraceComponent_10365101");
//(offsetof(UTraceComponent_10365101, Config) == 0x0016A8, "Member 'UTraceComponent_10365101::Config' has a wrong offset!");

// Class Hero_1036.BuffAbility_10365101
// 0x0050 (0x1138 - 0x10E8)
class UBuffAbility_10365101 : public UMarvelEffectGameplayAbility
{
public:
	int32                                         StunBuffId;                                        // 0x10E8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CountToStun;                                       // 0x10EC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10F0[0x48];                                    // 0x10F0(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnAddSlowDown(class UMarvelBaseAbilitySystemComponent* TargetComp, const float Value);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BuffAbility_10365101">();
	}
	static class UBuffAbility_10365101* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBuffAbility_10365101>();
	}
};
//(alignof(UBuffAbility_10365101) == 0x000008, "Wrong alignment on UBuffAbility_10365101");
//(sizeof(UBuffAbility_10365101) == 0x001138, "Wrong size on UBuffAbility_10365101");
//(offsetof(UBuffAbility_10365101, StunBuffId) == 0x0010E8, "Member 'UBuffAbility_10365101::StunBuffId' has a wrong offset!");
//(offsetof(UBuffAbility_10365101, CountToStun) == 0x0010EC, "Member 'UBuffAbility_10365101::CountToStun' has a wrong offset!");

// Class Hero_1036.SkeletalMeshComponent_103651
// 0x0000 (0x16A0 - 0x16A0)
class USkeletalMeshComponent_103651 final : public USkeletalMeshComponent
{
public:
	void OnMontageEnded(class UAnimMontage* InMontage, bool IsInterrupted);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SkeletalMeshComponent_103651">();
	}
	static class USkeletalMeshComponent_103651* GetDefaultObj()
	{
		return GetDefaultObjImpl<USkeletalMeshComponent_103651>();
	}
};
//(alignof(USkeletalMeshComponent_103651) == 0x000010, "Wrong alignment on USkeletalMeshComponent_103651");
//(sizeof(USkeletalMeshComponent_103651) == 0x0016A0, "Wrong size on USkeletalMeshComponent_103651");

// Class Hero_1036.Cue_AbilityLoop_103651
// 0x00C0 (0x0EC0 - 0x0E00)
class ACue_AbilityLoop_103651 : public AMarvelCueNotify_Ability
{
public:
	class UNiagaraComponent*                      NiagaraLoopFX;                                     // 0x0E00(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 ShadowGenerateTimeList;                            // 0x0E08(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 ShadowAnimStartTimeOffsetList;                     // 0x0E18(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ShadowNum;                                         // 0x0E28(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsRenderCustomDepthPass;                           // 0x0E2C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E2D[0x3];                                      // 0x0E2D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           ShadowMontage;                                     // 0x0E30(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<int32, class UMaterialInterface*>        MaterialDict;                                      // 0x0E38(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TArray<class USkeletalMeshComponent_103651*>  ShadowMeshComponents;                              // 0x0E88(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_E98[0x28];                                     // 0x0E98(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Cue_AbilityLoop_103651">();
	}
	static class ACue_AbilityLoop_103651* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACue_AbilityLoop_103651>();
	}
};
//(alignof(ACue_AbilityLoop_103651) == 0x000008, "Wrong alignment on ACue_AbilityLoop_103651");
//(sizeof(ACue_AbilityLoop_103651) == 0x000EC0, "Wrong size on ACue_AbilityLoop_103651");
//(offsetof(ACue_AbilityLoop_103651, NiagaraLoopFX) == 0x000E00, "Member 'ACue_AbilityLoop_103651::NiagaraLoopFX' has a wrong offset!");
//(offsetof(ACue_AbilityLoop_103651, ShadowGenerateTimeList) == 0x000E08, "Member 'ACue_AbilityLoop_103651::ShadowGenerateTimeList' has a wrong offset!");
//(offsetof(ACue_AbilityLoop_103651, ShadowAnimStartTimeOffsetList) == 0x000E18, "Member 'ACue_AbilityLoop_103651::ShadowAnimStartTimeOffsetList' has a wrong offset!");
//(offsetof(ACue_AbilityLoop_103651, ShadowNum) == 0x000E28, "Member 'ACue_AbilityLoop_103651::ShadowNum' has a wrong offset!");
//(offsetof(ACue_AbilityLoop_103651, IsRenderCustomDepthPass) == 0x000E2C, "Member 'ACue_AbilityLoop_103651::IsRenderCustomDepthPass' has a wrong offset!");
//(offsetof(ACue_AbilityLoop_103651, ShadowMontage) == 0x000E30, "Member 'ACue_AbilityLoop_103651::ShadowMontage' has a wrong offset!");
//(offsetof(ACue_AbilityLoop_103651, MaterialDict) == 0x000E38, "Member 'ACue_AbilityLoop_103651::MaterialDict' has a wrong offset!");
//(offsetof(ACue_AbilityLoop_103651, ShadowMeshComponents) == 0x000E88, "Member 'ACue_AbilityLoop_103651::ShadowMeshComponents' has a wrong offset!");

// Class Hero_1036.Cue_AbilityLoop_103651_800
// 0x0008 (0x0EC8 - 0x0EC0)
class ACue_AbilityLoop_103651_800 final : public ACue_AbilityLoop_103651
{
public:
	class USkeletalMeshComponent*                 EquipMeshComponent;                                // 0x0EC0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Cue_AbilityLoop_103651_800">();
	}
	static class ACue_AbilityLoop_103651_800* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACue_AbilityLoop_103651_800>();
	}
};
//(alignof(ACue_AbilityLoop_103651_800) == 0x000008, "Wrong alignment on ACue_AbilityLoop_103651_800");
//(sizeof(ACue_AbilityLoop_103651_800) == 0x000EC8, "Wrong size on ACue_AbilityLoop_103651_800");
//(offsetof(ACue_AbilityLoop_103651_800, EquipMeshComponent) == 0x000EC0, "Member 'ACue_AbilityLoop_103651_800::EquipMeshComponent' has a wrong offset!");

// Class Hero_1036.Config_103661
// 0x1058 (0x10F0 - 0x0098)
class UConfig_103661 final : public UMarvelAbilityConfig
{
public:
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSelectTaskParam                       SelectTaskParam;                                   // 0x00A0(0x1040)(Edit, BlueprintVisible, BlueprintReadOnly, ContainsInstancedReference, NativeAccessSpecifierPublic)
	float                                         TraceInterval;                                     // 0x10E0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10E4[0xC];                                     // 0x10E4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Config_103661">();
	}
	static class UConfig_103661* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConfig_103661>();
	}
};
//(alignof(UConfig_103661) == 0x000010, "Wrong alignment on UConfig_103661");
//(sizeof(UConfig_103661) == 0x0010F0, "Wrong size on UConfig_103661");
//(offsetof(UConfig_103661, SelectTaskParam) == 0x0000A0, "Member 'UConfig_103661::SelectTaskParam' has a wrong offset!");
//(offsetof(UConfig_103661, TraceInterval) == 0x0010E0, "Member 'UConfig_103661::TraceInterval' has a wrong offset!");

// Class Hero_1036.Ability_103661
// 0x0090 (0x25E0 - 0x2550)
class UAbility_103661 : public UMarvelGameplayAbility
{
public:
	uint8                                         Pad_2550[0x8];                                     // 0x2550(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UConfig_103661*                         Config103661;                                      // 0x2558(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class AMarvelBaseCharacter*, float>      LastSeenTimeMap;                                   // 0x2560(0x0050)(NativeAccessSpecifierPublic)
	class UMarvelAbilityTask_SelectTarget*        SelectTask;                                        // 0x25B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMarvelGameplayAbility*                 Ability103662;                                     // 0x25B8(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25C0[0x20];                                    // 0x25C0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float GetLastSeeTime(class AMarvelBaseCharacter* Enemy);
	void OnTick(float DeltaTime);
	void OnTimeToTrace();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Ability_103661">();
	}
	static class UAbility_103661* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbility_103661>();
	}
};
//(alignof(UAbility_103661) == 0x000008, "Wrong alignment on UAbility_103661");
//(sizeof(UAbility_103661) == 0x0025E0, "Wrong size on UAbility_103661");
//(offsetof(UAbility_103661, Config103661) == 0x002558, "Member 'UAbility_103661::Config103661' has a wrong offset!");
//(offsetof(UAbility_103661, LastSeenTimeMap) == 0x002560, "Member 'UAbility_103661::LastSeenTimeMap' has a wrong offset!");
//(offsetof(UAbility_103661, SelectTask) == 0x0025B0, "Member 'UAbility_103661::SelectTask' has a wrong offset!");
//(offsetof(UAbility_103661, Ability103662) == 0x0025B8, "Member 'UAbility_103661::Ability103662' has a wrong offset!");

// Class Hero_1036.Config_103662
// 0x0080 (0x0118 - 0x0098)
class UConfig_103662 final : public UMarvelAbilityConfig
{
public:
	float                                         TimeThreshold;                                     // 0x0098(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EnhanceDangerHP;                                   // 0x009C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  IgnoreTags;                                        // 0x00A0(0x0068)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	int32                                         ScopeId;                                           // 0x0108(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BuffID;                                            // 0x010C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EnhanceBuffID;                                     // 0x0110(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Config_103662">();
	}
	static class UConfig_103662* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConfig_103662>();
	}
};
//(alignof(UConfig_103662) == 0x000008, "Wrong alignment on UConfig_103662");
//(sizeof(UConfig_103662) == 0x000118, "Wrong size on UConfig_103662");
//(offsetof(UConfig_103662, TimeThreshold) == 0x000098, "Member 'UConfig_103662::TimeThreshold' has a wrong offset!");
//(offsetof(UConfig_103662, EnhanceDangerHP) == 0x00009C, "Member 'UConfig_103662::EnhanceDangerHP' has a wrong offset!");
//(offsetof(UConfig_103662, IgnoreTags) == 0x0000A0, "Member 'UConfig_103662::IgnoreTags' has a wrong offset!");
//(offsetof(UConfig_103662, ScopeId) == 0x000108, "Member 'UConfig_103662::ScopeId' has a wrong offset!");
//(offsetof(UConfig_103662, BuffID) == 0x00010C, "Member 'UConfig_103662::BuffID' has a wrong offset!");
//(offsetof(UConfig_103662, EnhanceBuffID) == 0x000110, "Member 'UConfig_103662::EnhanceBuffID' has a wrong offset!");

// Class Hero_1036.Ability_103662
// 0x0030 (0x2580 - 0x2550)
class UAbility_103662 : public UMarvelGameplayAbility
{
public:
	uint8                                         Pad_2550[0x20];                                    // 0x2550(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             SensedEnemyDelegate;                               // 0x2570(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)

public:
	void OnAbilityEnd();
	void OnTimeToCancelAbility();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Ability_103662">();
	}
	static class UAbility_103662* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbility_103662>();
	}
};
//(alignof(UAbility_103662) == 0x000008, "Wrong alignment on UAbility_103662");
//(sizeof(UAbility_103662) == 0x002580, "Wrong size on UAbility_103662");
//(offsetof(UAbility_103662, SensedEnemyDelegate) == 0x002570, "Member 'UAbility_103662::SensedEnemyDelegate' has a wrong offset!");

// Class Hero_1036.EffectiveComponent_10366201
// 0x0030 (0x1C30 - 0x1C00)
class UEffectiveComponent_10366201 final : public UMarvelAgentEffectiveComponent
{
public:
	class UAbility_103661*                        Ability103661;                                     // 0x1BF8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbility_103662*                        Ability103662;                                     // 0x1C00(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UConfig_103662*                         Config103662;                                      // 0x1C08(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AMarvelBaseCharacter*                   Viewer;                                            // 0x1C10(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             EndAbility103662Delegate;                          // 0x1C18(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C28[0x8];                                     // 0x1C28(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EffectiveComponent_10366201">();
	}
	static class UEffectiveComponent_10366201* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEffectiveComponent_10366201>();
	}
};
//(alignof(UEffectiveComponent_10366201) == 0x000010, "Wrong alignment on UEffectiveComponent_10366201");
//(sizeof(UEffectiveComponent_10366201) == 0x001C30, "Wrong size on UEffectiveComponent_10366201");
//(offsetof(UEffectiveComponent_10366201, Ability103661) == 0x001BF8, "Member 'UEffectiveComponent_10366201::Ability103661' has a wrong offset!");
//(offsetof(UEffectiveComponent_10366201, Ability103662) == 0x001C00, "Member 'UEffectiveComponent_10366201::Ability103662' has a wrong offset!");
//(offsetof(UEffectiveComponent_10366201, Config103662) == 0x001C08, "Member 'UEffectiveComponent_10366201::Config103662' has a wrong offset!");
//(offsetof(UEffectiveComponent_10366201, Viewer) == 0x001C10, "Member 'UEffectiveComponent_10366201::Viewer' has a wrong offset!");
//(offsetof(UEffectiveComponent_10366201, EndAbility103662Delegate) == 0x001C18, "Member 'UEffectiveComponent_10366201::EndAbility103662Delegate' has a wrong offset!");

// Class Hero_1036.Cue_Buff_10366101
// 0x0008 (0x0FF0 - 0x0FE8)
class ACue_Buff_10366101 final : public AMarvelCueNotify_Buff
{
public:
	class AActor*                                 EffectCauser;                                      // 0x0FE8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Cue_Buff_10366101">();
	}
	static class ACue_Buff_10366101* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACue_Buff_10366101>();
	}
};
//(alignof(ACue_Buff_10366101) == 0x000008, "Wrong alignment on ACue_Buff_10366101");
//(sizeof(ACue_Buff_10366101) == 0x000FF0, "Wrong size on ACue_Buff_10366101");
//(offsetof(ACue_Buff_10366101, EffectCauser) == 0x000FE8, "Member 'ACue_Buff_10366101::EffectCauser' has a wrong offset!");

// Class Hero_1036.Cue_Ability_Instant_10366201
// 0x0010 (0x0378 - 0x0368)
class UCue_Ability_Instant_10366201 final : public UMarvelCueNotify_Base
{
public:
	class UNiagaraComponent*                      FXSystemComp;                                      // 0x0368(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AMarvelBaseCharacter*                   TargetChar;                                        // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void OnCharacterEndPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Cue_Ability_Instant_10366201">();
	}
	static class UCue_Ability_Instant_10366201* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCue_Ability_Instant_10366201>();
	}
};
//(alignof(UCue_Ability_Instant_10366201) == 0x000008, "Wrong alignment on UCue_Ability_Instant_10366201");
//(sizeof(UCue_Ability_Instant_10366201) == 0x000378, "Wrong size on UCue_Ability_Instant_10366201");
//(offsetof(UCue_Ability_Instant_10366201, FXSystemComp) == 0x000368, "Member 'UCue_Ability_Instant_10366201::FXSystemComp' has a wrong offset!");
//(offsetof(UCue_Ability_Instant_10366201, TargetChar) == 0x000370, "Member 'UCue_Ability_Instant_10366201::TargetChar' has a wrong offset!");

// Class Hero_1036.Cue_Ability_Loop_10366201
// 0x0050 (0x0E50 - 0x0E00)
class ACue_Ability_Loop_10366201 final : public AMarvelCueNotify_Ability
{
public:
	class AMarvelBaseCharacter*                   MarvelCharacter;                                   // 0x0E00(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E08[0x20];                                     // 0x0E08(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      NiagaraLoopFX;                                     // 0x0E28(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            DissolveCurve;                                     // 0x0E30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DissolveParamName;                                 // 0x0E38(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CueDuration;                                       // 0x0E48(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E4C[0x4];                                      // 0x0E4C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void RemoveCue();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Cue_Ability_Loop_10366201">();
	}
	static class ACue_Ability_Loop_10366201* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACue_Ability_Loop_10366201>();
	}
};
//(alignof(ACue_Ability_Loop_10366201) == 0x000008, "Wrong alignment on ACue_Ability_Loop_10366201");
//(sizeof(ACue_Ability_Loop_10366201) == 0x000E50, "Wrong size on ACue_Ability_Loop_10366201");
//(offsetof(ACue_Ability_Loop_10366201, MarvelCharacter) == 0x000E00, "Member 'ACue_Ability_Loop_10366201::MarvelCharacter' has a wrong offset!");
//(offsetof(ACue_Ability_Loop_10366201, NiagaraLoopFX) == 0x000E28, "Member 'ACue_Ability_Loop_10366201::NiagaraLoopFX' has a wrong offset!");
//(offsetof(ACue_Ability_Loop_10366201, DissolveCurve) == 0x000E30, "Member 'ACue_Ability_Loop_10366201::DissolveCurve' has a wrong offset!");
//(offsetof(ACue_Ability_Loop_10366201, DissolveParamName) == 0x000E38, "Member 'ACue_Ability_Loop_10366201::DissolveParamName' has a wrong offset!");
//(offsetof(ACue_Ability_Loop_10366201, CueDuration) == 0x000E48, "Member 'ACue_Ability_Loop_10366201::CueDuration' has a wrong offset!");

// Class Hero_1036.Config_103681
// 0x16F8 (0x1790 - 0x0098)
class UConfig_103681 final : public UMarvelAbilityConfig
{
public:
	float                                         SpecialFallingMinSpeed;                            // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpecialFallingMinHeight;                           // 0x009C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndSpecialFallingMaxHeight;                        // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDashAbilityInfo                       DashInfo;                                          // 0x00A8(0x0B70)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FDashAbilityInfo                       DashInfoToRun;                                     // 0x0C18(0x0B70)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                         TimeDelayToDash;                                   // 0x1788(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_178C[0x4];                                     // 0x178C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Config_103681">();
	}
	static class UConfig_103681* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConfig_103681>();
	}
};
//(alignof(UConfig_103681) == 0x000008, "Wrong alignment on UConfig_103681");
//(sizeof(UConfig_103681) == 0x001790, "Wrong size on UConfig_103681");
//(offsetof(UConfig_103681, SpecialFallingMinSpeed) == 0x000098, "Member 'UConfig_103681::SpecialFallingMinSpeed' has a wrong offset!");
//(offsetof(UConfig_103681, SpecialFallingMinHeight) == 0x00009C, "Member 'UConfig_103681::SpecialFallingMinHeight' has a wrong offset!");
//(offsetof(UConfig_103681, EndSpecialFallingMaxHeight) == 0x0000A0, "Member 'UConfig_103681::EndSpecialFallingMaxHeight' has a wrong offset!");
//(offsetof(UConfig_103681, DashInfo) == 0x0000A8, "Member 'UConfig_103681::DashInfo' has a wrong offset!");
//(offsetof(UConfig_103681, DashInfoToRun) == 0x000C18, "Member 'UConfig_103681::DashInfoToRun' has a wrong offset!");
//(offsetof(UConfig_103681, TimeDelayToDash) == 0x001788, "Member 'UConfig_103681::TimeDelayToDash' has a wrong offset!");

// Class Hero_1036.Ability_103681
// 0x00C8 (0x2618 - 0x2550)
class UAbility_103681 : public UMarvelGameplayAbility
{
public:
	uint8                                         Pad_2550[0xC8];                                    // 0x2550(0x00C8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ApplyDash();
	void OnDashFinish(EDashStopReason Reason);
	void OnTick(float DeltaTime);
	void ServerEndSpecialFalling(bool ByCancelled);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Ability_103681">();
	}
	static class UAbility_103681* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbility_103681>();
	}
};
//(alignof(UAbility_103681) == 0x000008, "Wrong alignment on UAbility_103681");
//(sizeof(UAbility_103681) == 0x002618, "Wrong size on UAbility_103681");

// Class Hero_1036.EpicMomentAction_1036
// 0x0020 (0x0140 - 0x0120)
class UEpicMomentAction_1036 : public UEpicMomentBaseAction
{
public:
	struct FEpicMomentNodeInfo                    ShiftConfig;                                       // 0x0120(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ShiftBuffID;                                       // 0x012C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 ShiftInterruptAbilities;                           // 0x0130(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	void OnActorAbilityCancel(class AActor* Source, int32 AbilityID, const class FString& SessionID, class UMarvelGameplayAbility* SourceAbility);
	void OnGameplayEffectAppliedToTarget(class UAbilitySystemComponent* ASC, const struct FGameplayEffectSpec& GameplayEffectSpec, const struct FActiveGameplayEffectHandle& ActiveGameplayEffectHandle);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EpicMomentAction_1036">();
	}
	static class UEpicMomentAction_1036* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEpicMomentAction_1036>();
	}
};
//(alignof(UEpicMomentAction_1036) == 0x000008, "Wrong alignment on UEpicMomentAction_1036");
//(sizeof(UEpicMomentAction_1036) == 0x000140, "Wrong size on UEpicMomentAction_1036");
//(offsetof(UEpicMomentAction_1036, ShiftConfig) == 0x000120, "Member 'UEpicMomentAction_1036::ShiftConfig' has a wrong offset!");
//(offsetof(UEpicMomentAction_1036, ShiftBuffID) == 0x00012C, "Member 'UEpicMomentAction_1036::ShiftBuffID' has a wrong offset!");
//(offsetof(UEpicMomentAction_1036, ShiftInterruptAbilities) == 0x000130, "Member 'UEpicMomentAction_1036::ShiftInterruptAbilities' has a wrong offset!");

// Class Hero_1036.SpiderManAnimInstance
// 0x0120 (0x14A0 - 0x1380)
class USpiderManAnimInstance final : public USpiderManBaseAnimInstance
{
public:
	float                                         FacingSpeed;                                       // 0x1380(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FacingBackSpeed;                                   // 0x1384(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         StopTime;                                          // 0x1388(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxYaw;                                            // 0x138C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RemainTimeToInterrupt103614;                       // 0x1390(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TimeToUseSpecialAnimToDoubleJump;                  // 0x1394(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                               CurRot;                                            // 0x1398(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	EAbilityState103614                           AbilityState103614;                                // 0x13B0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_13B1[0x3];                                     // 0x13B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Direction103614;                                   // 0x13B4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         StartAccelerationAngle;                            // 0x13B8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
