#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Hero_1011

#include "Basic.hpp"

#include "Hero_1011_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Marvel_structs.hpp"
#include "Marvel_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Hero_Synergy_classes.hpp"


namespace SDK
{

// Class Hero_1011.Cue_Ability_Loop_Morph
// 0x0100 (0x0F00 - 0x0E00)
class ACue_Ability_Loop_Morph final : public AMarvelCueNotify_Ability
{
public:
	struct FGameplayTag                           HulkStateTag;                                      // 0x0E00(0x000C)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TimerTotal;                                        // 0x0E0C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 HeroSourcePrefix;                                  // 0x0E10(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceConstant*              SourceBody;                                        // 0x0E20(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceConstant*              SourceHead;                                        // 0x0E28(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 HeroTargetPrefix;                                  // 0x0E30(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceConstant*              TargetBody;                                        // 0x0E40(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceConstant*              TargetHead;                                        // 0x0E48(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   DynamicMaterialBodySlotName;                       // 0x0E50(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E5C[0x4];                                      // 0x0E5C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceConstant*              BodyMorphSourceMaterial;                           // 0x0E60(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTexture2D*                             BodyMorphMask;                                     // 0x0E68(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   DynamicMaterialHeadSlotName;                       // 0x0E70(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E7C[0x4];                                      // 0x0E7C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceConstant*              HeadMorphSourceMaterial;                           // 0x0E80(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTexture2D*                             HeadMorphMask;                                     // 0x0E88(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseMTPositionForCurve;                            // 0x0E90(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E91[0x7];                                      // 0x0E91(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            MorphWeightCurve;                                  // 0x0E98(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class FName>                           HeroShadowParameterNames;                          // 0x0EA0(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FTimerHandle                           TimerHandle;                                       // 0x0EB0(0x0018)(Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USkeletalMeshComponent*                 MorphMesh;                                         // 0x0EC8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AMarvelBaseCharacter*                   OwnerCharacter;                                    // 0x0ED0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bMorphSuccess;                                     // 0x0ED8(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_ED9[0x3];                                      // 0x0ED9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TimerSpent;                                        // 0x0EDC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TimerFrequence;                                    // 0x0EE0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_EE4[0x4];                                      // 0x0EE4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               DynamicMaterialBody;                               // 0x0EE8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*               DynamicMaterialHead;                               // 0x0EF0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         DynamicMaterialBodyElementIndex;                   // 0x0EF8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         DynamicMaterialHeadElementIndex;                   // 0x0EFC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Cue_Ability_Loop_Morph">();
	}
	static class ACue_Ability_Loop_Morph* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACue_Ability_Loop_Morph>();
	}
};
static_assert(alignof(ACue_Ability_Loop_Morph) == 0x000008, "Wrong alignment on ACue_Ability_Loop_Morph");
static_assert(sizeof(ACue_Ability_Loop_Morph) == 0x000F00, "Wrong size on ACue_Ability_Loop_Morph");
static_assert(offsetof(ACue_Ability_Loop_Morph, HulkStateTag) == 0x000E00, "Member 'ACue_Ability_Loop_Morph::HulkStateTag' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_Morph, TimerTotal) == 0x000E0C, "Member 'ACue_Ability_Loop_Morph::TimerTotal' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_Morph, HeroSourcePrefix) == 0x000E10, "Member 'ACue_Ability_Loop_Morph::HeroSourcePrefix' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_Morph, SourceBody) == 0x000E20, "Member 'ACue_Ability_Loop_Morph::SourceBody' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_Morph, SourceHead) == 0x000E28, "Member 'ACue_Ability_Loop_Morph::SourceHead' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_Morph, HeroTargetPrefix) == 0x000E30, "Member 'ACue_Ability_Loop_Morph::HeroTargetPrefix' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_Morph, TargetBody) == 0x000E40, "Member 'ACue_Ability_Loop_Morph::TargetBody' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_Morph, TargetHead) == 0x000E48, "Member 'ACue_Ability_Loop_Morph::TargetHead' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_Morph, DynamicMaterialBodySlotName) == 0x000E50, "Member 'ACue_Ability_Loop_Morph::DynamicMaterialBodySlotName' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_Morph, BodyMorphSourceMaterial) == 0x000E60, "Member 'ACue_Ability_Loop_Morph::BodyMorphSourceMaterial' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_Morph, BodyMorphMask) == 0x000E68, "Member 'ACue_Ability_Loop_Morph::BodyMorphMask' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_Morph, DynamicMaterialHeadSlotName) == 0x000E70, "Member 'ACue_Ability_Loop_Morph::DynamicMaterialHeadSlotName' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_Morph, HeadMorphSourceMaterial) == 0x000E80, "Member 'ACue_Ability_Loop_Morph::HeadMorphSourceMaterial' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_Morph, HeadMorphMask) == 0x000E88, "Member 'ACue_Ability_Loop_Morph::HeadMorphMask' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_Morph, bUseMTPositionForCurve) == 0x000E90, "Member 'ACue_Ability_Loop_Morph::bUseMTPositionForCurve' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_Morph, MorphWeightCurve) == 0x000E98, "Member 'ACue_Ability_Loop_Morph::MorphWeightCurve' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_Morph, HeroShadowParameterNames) == 0x000EA0, "Member 'ACue_Ability_Loop_Morph::HeroShadowParameterNames' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_Morph, TimerHandle) == 0x000EB0, "Member 'ACue_Ability_Loop_Morph::TimerHandle' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_Morph, MorphMesh) == 0x000EC8, "Member 'ACue_Ability_Loop_Morph::MorphMesh' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_Morph, OwnerCharacter) == 0x000ED0, "Member 'ACue_Ability_Loop_Morph::OwnerCharacter' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_Morph, bMorphSuccess) == 0x000ED8, "Member 'ACue_Ability_Loop_Morph::bMorphSuccess' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_Morph, TimerSpent) == 0x000EDC, "Member 'ACue_Ability_Loop_Morph::TimerSpent' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_Morph, TimerFrequence) == 0x000EE0, "Member 'ACue_Ability_Loop_Morph::TimerFrequence' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_Morph, DynamicMaterialBody) == 0x000EE8, "Member 'ACue_Ability_Loop_Morph::DynamicMaterialBody' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_Morph, DynamicMaterialHead) == 0x000EF0, "Member 'ACue_Ability_Loop_Morph::DynamicMaterialHead' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_Morph, DynamicMaterialBodyElementIndex) == 0x000EF8, "Member 'ACue_Ability_Loop_Morph::DynamicMaterialBodyElementIndex' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_Morph, DynamicMaterialHeadElementIndex) == 0x000EFC, "Member 'ACue_Ability_Loop_Morph::DynamicMaterialHeadElementIndex' has a wrong offset!");

// Class Hero_1011.Ability_HulkSculpt
// 0x0000 (0x2808 - 0x2808)
class UAbility_HulkSculpt final : public UAbility_109
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Ability_HulkSculpt">();
	}
	static class UAbility_HulkSculpt* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbility_HulkSculpt>();
	}
};
static_assert(alignof(UAbility_HulkSculpt) == 0x000008, "Wrong alignment on UAbility_HulkSculpt");
static_assert(sizeof(UAbility_HulkSculpt) == 0x002808, "Wrong size on UAbility_HulkSculpt");

// Class Hero_1011.Cue_Weapon_Loop_101111
// 0x0048 (0x10A0 - 0x1058)
class ACue_Weapon_Loop_101111 final : public AMarvelCueNotify_Weapon_Loop
{
public:
	class UStaticMeshComponent*                   Container;                                         // 0x1058(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               Mid;                                               // 0x1060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AHulkBannerCharacter*                   BannerChar;                                        // 0x1068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTimerHandle                           LoopTimerHandle;                                   // 0x1070(0x0018)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1088[0x18];                                    // 0x1088(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ChangeContainerState();
	void OnOwnedTagUpdate(const struct FGameplayTag& TagUpdated, bool bTagExists);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Cue_Weapon_Loop_101111">();
	}
	static class ACue_Weapon_Loop_101111* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACue_Weapon_Loop_101111>();
	}
};
static_assert(alignof(ACue_Weapon_Loop_101111) == 0x000008, "Wrong alignment on ACue_Weapon_Loop_101111");
static_assert(sizeof(ACue_Weapon_Loop_101111) == 0x0010A0, "Wrong size on ACue_Weapon_Loop_101111");
static_assert(offsetof(ACue_Weapon_Loop_101111, Container) == 0x001058, "Member 'ACue_Weapon_Loop_101111::Container' has a wrong offset!");
static_assert(offsetof(ACue_Weapon_Loop_101111, Mid) == 0x001060, "Member 'ACue_Weapon_Loop_101111::Mid' has a wrong offset!");
static_assert(offsetof(ACue_Weapon_Loop_101111, BannerChar) == 0x001068, "Member 'ACue_Weapon_Loop_101111::BannerChar' has a wrong offset!");
static_assert(offsetof(ACue_Weapon_Loop_101111, LoopTimerHandle) == 0x001070, "Member 'ACue_Weapon_Loop_101111::LoopTimerHandle' has a wrong offset!");

// Class Hero_1011.Config_101141
// 0x0030 (0x00C8 - 0x0098)
class UConfig_101141 final : public UMarvelAbilityConfig
{
public:
	int32                                         SelfSummonedID;                                    // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 SelfBuffID;                                        // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         TeammateSummonedID;                                // 0x00B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 TeammateBuffID;                                    // 0x00B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Config_101141">();
	}
	static class UConfig_101141* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConfig_101141>();
	}
};
static_assert(alignof(UConfig_101141) == 0x000008, "Wrong alignment on UConfig_101141");
static_assert(sizeof(UConfig_101141) == 0x0000C8, "Wrong size on UConfig_101141");
static_assert(offsetof(UConfig_101141, SelfSummonedID) == 0x000098, "Member 'UConfig_101141::SelfSummonedID' has a wrong offset!");
static_assert(offsetof(UConfig_101141, SelfBuffID) == 0x0000A0, "Member 'UConfig_101141::SelfBuffID' has a wrong offset!");
static_assert(offsetof(UConfig_101141, TeammateSummonedID) == 0x0000B0, "Member 'UConfig_101141::TeammateSummonedID' has a wrong offset!");
static_assert(offsetof(UConfig_101141, TeammateBuffID) == 0x0000B8, "Member 'UConfig_101141::TeammateBuffID' has a wrong offset!");

// Class Hero_1011.EffectiveComponent_10114101
// 0x0000 (0x1C00 - 0x1C00)
class UEffectiveComponent_10114101 final : public UMarvelAgentEffectiveComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EffectiveComponent_10114101">();
	}
	static class UEffectiveComponent_10114101* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEffectiveComponent_10114101>();
	}
};
static_assert(alignof(UEffectiveComponent_10114101) == 0x000010, "Wrong alignment on UEffectiveComponent_10114101");
static_assert(sizeof(UEffectiveComponent_10114101) == 0x001C00, "Wrong size on UEffectiveComponent_10114101");

// Class Hero_1011.Cue_Ability_Instant_10114101
// 0x0008 (0x0370 - 0x0368)
class UCue_Ability_Instant_10114101 final : public UMarvelCueNotify_Base
{
public:
	int32                                         ScopeId;                                           // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FXInitRadius;                                      // 0x036C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Cue_Ability_Instant_10114101">();
	}
	static class UCue_Ability_Instant_10114101* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCue_Ability_Instant_10114101>();
	}
};
static_assert(alignof(UCue_Ability_Instant_10114101) == 0x000008, "Wrong alignment on UCue_Ability_Instant_10114101");
static_assert(sizeof(UCue_Ability_Instant_10114101) == 0x000370, "Wrong size on UCue_Ability_Instant_10114101");
static_assert(offsetof(UCue_Ability_Instant_10114101, ScopeId) == 0x000368, "Member 'UCue_Ability_Instant_10114101::ScopeId' has a wrong offset!");
static_assert(offsetof(UCue_Ability_Instant_10114101, FXInitRadius) == 0x00036C, "Member 'UCue_Ability_Instant_10114101::FXInitRadius' has a wrong offset!");

// Class Hero_1011.Ability_101171
// 0x0008 (0x2558 - 0x2550)
class UAbility_101171 : public UMarvelGameplayAbility
{
public:
	class UMarvelAbilityTask_SelectTarget*        SelectTask;                                        // 0x2550(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	struct FVector CalcSmashLocation(const class AActor* TargetActor, class AMarvelBaseCharacter* OutHulk);
	class AActor* GetTarget();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Ability_101171">();
	}
	static class UAbility_101171* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbility_101171>();
	}
};
static_assert(alignof(UAbility_101171) == 0x000008, "Wrong alignment on UAbility_101171");
static_assert(sizeof(UAbility_101171) == 0x002558, "Wrong size on UAbility_101171");
static_assert(offsetof(UAbility_101171, SelectTask) == 0x002550, "Member 'UAbility_101171::SelectTask' has a wrong offset!");

// Class Hero_1011.Config_101171
// 0x1078 (0x1110 - 0x0098)
class UConfig_101171 : public UMarvelAbilityConfig
{
public:
	float                                         SmashBeginTime;                                    // 0x0098(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SmashEndLocationOffset;                            // 0x00A0(0x0018)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SmashLookingPitch;                                 // 0x00B8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SmashTargetArmLength;                              // 0x00BC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SmashSpringArmSpeed;                               // 0x00C0(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SmashCameraLagSpeed;                               // 0x00C4(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSelectTaskParam                       SelectTaskParam;                                   // 0x00D0(0x1040)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Config_101171">();
	}
	static class UConfig_101171* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConfig_101171>();
	}
};
static_assert(alignof(UConfig_101171) == 0x000010, "Wrong alignment on UConfig_101171");
static_assert(sizeof(UConfig_101171) == 0x001110, "Wrong size on UConfig_101171");
static_assert(offsetof(UConfig_101171, SmashBeginTime) == 0x000098, "Member 'UConfig_101171::SmashBeginTime' has a wrong offset!");
static_assert(offsetof(UConfig_101171, SmashEndLocationOffset) == 0x0000A0, "Member 'UConfig_101171::SmashEndLocationOffset' has a wrong offset!");
static_assert(offsetof(UConfig_101171, SmashLookingPitch) == 0x0000B8, "Member 'UConfig_101171::SmashLookingPitch' has a wrong offset!");
static_assert(offsetof(UConfig_101171, SmashTargetArmLength) == 0x0000BC, "Member 'UConfig_101171::SmashTargetArmLength' has a wrong offset!");
static_assert(offsetof(UConfig_101171, SmashSpringArmSpeed) == 0x0000C0, "Member 'UConfig_101171::SmashSpringArmSpeed' has a wrong offset!");
static_assert(offsetof(UConfig_101171, SmashCameraLagSpeed) == 0x0000C4, "Member 'UConfig_101171::SmashCameraLagSpeed' has a wrong offset!");
static_assert(offsetof(UConfig_101171, SelectTaskParam) == 0x0000D0, "Member 'UConfig_101171::SelectTaskParam' has a wrong offset!");

// Class Hero_1011.Cue_Buff_10117101
// 0x0088 (0x1070 - 0x0FE8)
class ACue_Buff_10117101 : public AMarvelCueNotify_Buff
{
public:
	class AActor*                                 OwnerCharacter;                                    // 0x0FE8(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AMarvelBaseCharacter*                   InstigatorCharacter;                               // 0x0FF0(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 OwnerCharacterMesh;                                // 0x0FF8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             SmashMeshTransform;                                // 0x1000(0x0060)(Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSmashing;                                       // 0x1060(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1061[0xF];                                     // 0x1061(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void K2_OnRecycle();
	void LoopCheck();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Cue_Buff_10117101">();
	}
	static class ACue_Buff_10117101* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACue_Buff_10117101>();
	}
};
static_assert(alignof(ACue_Buff_10117101) == 0x000010, "Wrong alignment on ACue_Buff_10117101");
static_assert(sizeof(ACue_Buff_10117101) == 0x001070, "Wrong size on ACue_Buff_10117101");
static_assert(offsetof(ACue_Buff_10117101, OwnerCharacter) == 0x000FE8, "Member 'ACue_Buff_10117101::OwnerCharacter' has a wrong offset!");
static_assert(offsetof(ACue_Buff_10117101, InstigatorCharacter) == 0x000FF0, "Member 'ACue_Buff_10117101::InstigatorCharacter' has a wrong offset!");
static_assert(offsetof(ACue_Buff_10117101, OwnerCharacterMesh) == 0x000FF8, "Member 'ACue_Buff_10117101::OwnerCharacterMesh' has a wrong offset!");
static_assert(offsetof(ACue_Buff_10117101, SmashMeshTransform) == 0x001000, "Member 'ACue_Buff_10117101::SmashMeshTransform' has a wrong offset!");
static_assert(offsetof(ACue_Buff_10117101, bIsSmashing) == 0x001060, "Member 'ACue_Buff_10117101::bIsSmashing' has a wrong offset!");

// Class Hero_1011.EffectAbility_101171
// 0x0030 (0x1118 - 0x10E8)
class UEffectAbility_101171 : public UMarvelEffectGameplayAbility
{
public:
	int32                                         InstigatorAbilityId;                               // 0x10E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10EC[0x4];                                     // 0x10EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 OwnerCharacter;                                    // 0x10F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 OwnerCharacterMesh;                                // 0x10F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AMarvelBaseCharacter*                   InstigatorCharacter;                               // 0x1100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 InstigatorCharacterMesh;                           // 0x1108(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsReadyToSmash;                                   // 0x1110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1111[0x7];                                     // 0x1111(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EffectAbility_101171">();
	}
	static class UEffectAbility_101171* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEffectAbility_101171>();
	}
};
static_assert(alignof(UEffectAbility_101171) == 0x000008, "Wrong alignment on UEffectAbility_101171");
static_assert(sizeof(UEffectAbility_101171) == 0x001118, "Wrong size on UEffectAbility_101171");
static_assert(offsetof(UEffectAbility_101171, InstigatorAbilityId) == 0x0010E8, "Member 'UEffectAbility_101171::InstigatorAbilityId' has a wrong offset!");
static_assert(offsetof(UEffectAbility_101171, OwnerCharacter) == 0x0010F0, "Member 'UEffectAbility_101171::OwnerCharacter' has a wrong offset!");
static_assert(offsetof(UEffectAbility_101171, OwnerCharacterMesh) == 0x0010F8, "Member 'UEffectAbility_101171::OwnerCharacterMesh' has a wrong offset!");
static_assert(offsetof(UEffectAbility_101171, InstigatorCharacter) == 0x001100, "Member 'UEffectAbility_101171::InstigatorCharacter' has a wrong offset!");
static_assert(offsetof(UEffectAbility_101171, InstigatorCharacterMesh) == 0x001108, "Member 'UEffectAbility_101171::InstigatorCharacterMesh' has a wrong offset!");
static_assert(offsetof(UEffectAbility_101171, bIsReadyToSmash) == 0x001110, "Member 'UEffectAbility_101171::bIsReadyToSmash' has a wrong offset!");

// Class Hero_1011.UIC_SelectTarget_101181
// 0x0000 (0x0158 - 0x0158)
class UUIC_SelectTarget_101181 final : public UUIC_SelectTarget
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UIC_SelectTarget_101181">();
	}
	static class UUIC_SelectTarget_101181* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIC_SelectTarget_101181>();
	}
};
static_assert(alignof(UUIC_SelectTarget_101181) == 0x000008, "Wrong alignment on UUIC_SelectTarget_101181");
static_assert(sizeof(UUIC_SelectTarget_101181) == 0x000158, "Wrong size on UUIC_SelectTarget_101181");

// Class Hero_1011.Cue_Projectile_Loop_101182
// 0x0068 (0x0E58 - 0x0DF0)
class ACue_Projectile_Loop_101182 final : public ACue_Physics_Projectile_Loop
{
public:
	TMap<EPhysicsWeaponType, float>               ParticleNumMap;                                    // 0x0DF0(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FName                                   ParticleNumName;                                   // 0x0E40(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E4C[0x4];                                      // 0x0E4C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      NS_Trajectory;                                     // 0x0E50(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Cue_Projectile_Loop_101182">();
	}
	static class ACue_Projectile_Loop_101182* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACue_Projectile_Loop_101182>();
	}
};
static_assert(alignof(ACue_Projectile_Loop_101182) == 0x000008, "Wrong alignment on ACue_Projectile_Loop_101182");
static_assert(sizeof(ACue_Projectile_Loop_101182) == 0x000E58, "Wrong size on ACue_Projectile_Loop_101182");
static_assert(offsetof(ACue_Projectile_Loop_101182, ParticleNumMap) == 0x000DF0, "Member 'ACue_Projectile_Loop_101182::ParticleNumMap' has a wrong offset!");
static_assert(offsetof(ACue_Projectile_Loop_101182, ParticleNumName) == 0x000E40, "Member 'ACue_Projectile_Loop_101182::ParticleNumName' has a wrong offset!");
static_assert(offsetof(ACue_Projectile_Loop_101182, NS_Trajectory) == 0x000E50, "Member 'ACue_Projectile_Loop_101182::NS_Trajectory' has a wrong offset!");

// Class Hero_1011.Ability_101191
// 0x00B8 (0x2620 - 0x2568)
class UAbility_101191 : public UMarvelAbility_LongPressTrigger
{
public:
	class UHulkBannerMoveLogicBaseComponent*      MoveLogicCom;                                      // 0x2568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AMarvelBaseCharacter*                   OwnerCharacter;                                    // 0x2570(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPredictionKey                         LaunchKey;                                         // 0x2578(0x00A0)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMarvelBaseAbilitySystemComponent*      ASC;                                               // 0x2618(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void K2_OnShiftJumpLaunched();
	void LaunchCharacter();
	void OnServerReceiveLaunchVelocity(const struct FGameplayAbilityTargetDataHandle& Data);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Ability_101191">();
	}
	static class UAbility_101191* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbility_101191>();
	}
};
static_assert(alignof(UAbility_101191) == 0x000008, "Wrong alignment on UAbility_101191");
static_assert(sizeof(UAbility_101191) == 0x002620, "Wrong size on UAbility_101191");
static_assert(offsetof(UAbility_101191, MoveLogicCom) == 0x002568, "Member 'UAbility_101191::MoveLogicCom' has a wrong offset!");
static_assert(offsetof(UAbility_101191, OwnerCharacter) == 0x002570, "Member 'UAbility_101191::OwnerCharacter' has a wrong offset!");
static_assert(offsetof(UAbility_101191, LaunchKey) == 0x002578, "Member 'UAbility_101191::LaunchKey' has a wrong offset!");
static_assert(offsetof(UAbility_101191, ASC) == 0x002618, "Member 'UAbility_101191::ASC' has a wrong offset!");

// Class Hero_1011.Cue_Ability_Loop_10119101
// 0x0068 (0x0E68 - 0x0E00)
class ACue_Ability_Loop_10119101 : public AMarvelCueNotify_Ability
{
public:
	struct FTimerHandle                           LoopTimerHandle;                                   // 0x0E00(0x0018)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsJumpLineVisible;                                // 0x0E18(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsCharging;                                       // 0x0E19(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1A[0x6];                                      // 0x0E1A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarvelGameplayAbility*                 OwnerAbility;                                      // 0x0E20(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AHulkBannerCharacter*                   OwnerCharacter;                                    // 0x0E28(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ConfigPressedSecondsMin;                           // 0x0E30(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E34[0x4];                                      // 0x0E34(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class ULegacyCameraShake>         ConfigJumpLandCameraShakeClass;                    // 0x0E38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ULegacyCameraShake>         ConfigJumpGrabHitCameraShakeClass;                 // 0x0E40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFXSystemAsset*                         ConfigGrabHitParticle;                             // 0x0E48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsGrabHitParticleAttach;                          // 0x0E50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E51[0x3];                                      // 0x0E51(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         OwningAbilityID;                                   // 0x0E54(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         JumpChargeAudioID;                                 // 0x0E58(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E5C[0x4];                                      // 0x0E5C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      NS_BasisTrack;                                     // 0x0E60(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void ClearLoopTimer();
	class UMarvelGameplayAbility* GetOwnerAbility();
	class AHulkBannerCharacter* GetOwnerChar();
	void LoopSetJumpParams();
	void SetAudio(bool bReset);
	void SetJumpLineVisible(bool bIsVisible);
	void SetLoopTimer();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Cue_Ability_Loop_10119101">();
	}
	static class ACue_Ability_Loop_10119101* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACue_Ability_Loop_10119101>();
	}
};
static_assert(alignof(ACue_Ability_Loop_10119101) == 0x000008, "Wrong alignment on ACue_Ability_Loop_10119101");
static_assert(sizeof(ACue_Ability_Loop_10119101) == 0x000E68, "Wrong size on ACue_Ability_Loop_10119101");
static_assert(offsetof(ACue_Ability_Loop_10119101, LoopTimerHandle) == 0x000E00, "Member 'ACue_Ability_Loop_10119101::LoopTimerHandle' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_10119101, bIsJumpLineVisible) == 0x000E18, "Member 'ACue_Ability_Loop_10119101::bIsJumpLineVisible' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_10119101, bIsCharging) == 0x000E19, "Member 'ACue_Ability_Loop_10119101::bIsCharging' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_10119101, OwnerAbility) == 0x000E20, "Member 'ACue_Ability_Loop_10119101::OwnerAbility' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_10119101, OwnerCharacter) == 0x000E28, "Member 'ACue_Ability_Loop_10119101::OwnerCharacter' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_10119101, ConfigPressedSecondsMin) == 0x000E30, "Member 'ACue_Ability_Loop_10119101::ConfigPressedSecondsMin' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_10119101, ConfigJumpLandCameraShakeClass) == 0x000E38, "Member 'ACue_Ability_Loop_10119101::ConfigJumpLandCameraShakeClass' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_10119101, ConfigJumpGrabHitCameraShakeClass) == 0x000E40, "Member 'ACue_Ability_Loop_10119101::ConfigJumpGrabHitCameraShakeClass' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_10119101, ConfigGrabHitParticle) == 0x000E48, "Member 'ACue_Ability_Loop_10119101::ConfigGrabHitParticle' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_10119101, bIsGrabHitParticleAttach) == 0x000E50, "Member 'ACue_Ability_Loop_10119101::bIsGrabHitParticleAttach' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_10119101, OwningAbilityID) == 0x000E54, "Member 'ACue_Ability_Loop_10119101::OwningAbilityID' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_10119101, JumpChargeAudioID) == 0x000E58, "Member 'ACue_Ability_Loop_10119101::JumpChargeAudioID' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_10119101, NS_BasisTrack) == 0x000E60, "Member 'ACue_Ability_Loop_10119101::NS_BasisTrack' has a wrong offset!");

// Class Hero_1011.UIController_101191
// 0x0120 (0x0D78 - 0x0C58)
class UUIController_101191 : public UUIC_Ability
{
public:
	struct FTimerHandle                           LoopSetChargePerTimerHandle;                       // 0x0C58(0x0018)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCueHintData                           HintData;                                          // 0x0C70(0x0098)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class UWidget_AbilityEnergy*                  WidgetAbilityEnergyRight;                          // 0x0D08(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AHulkBannerCharacter*                   HulkBannerChar;                                    // 0x0D10(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHulkBannerMoveLogicBaseComponent*      MoveLogic;                                         // 0x0D18(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinChargeHulk;                                     // 0x0D20(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxChargeHulk;                                     // 0x0D24(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinChargeMonster;                                  // 0x0D28(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxChargeMonster;                                  // 0x0D2C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMarvelGameplayAbility*                 Ability101191;                                     // 0x0D30(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMarvelGameplayAbility*                 Ability101193;                                     // 0x0D38(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsCharge;                                         // 0x0D40(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsClimbing;                                       // 0x0D41(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsHanging;                                        // 0x0D42(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasShowHint;                                      // 0x0D43(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasInitHulkParam;                                 // 0x0D44(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasInitMonsterParam;                              // 0x0D45(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D46[0x2];                                      // 0x0D46(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMarvelUserWidget*                      WidgetTipLeft;                                     // 0x0D48(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMarvelUserWidget*                      WidgetTipRight;                                    // 0x0D50(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidget_AbilityStatusPanel*             AbilityPanel;                                      // 0x0D58(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTimerHandle                           LoopCheckTipsAndHintTimerHandle;                   // 0x0D60(0x0018)(HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	bool CanGetAbility();
	void Clear101191LoopTimer();
	void Clear101192LoopTimer();
	bool IsAbilityCharging();
	void LoopSetChargePer();
	bool PyInitChargeParam(bool bIsHulk);
	void Set101191LoopTimer();
	void Set101192LoopTimer();
	bool TryInitChargeParam(bool bIsHulk);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UIController_101191">();
	}
	static class UUIController_101191* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIController_101191>();
	}
};
static_assert(alignof(UUIController_101191) == 0x000008, "Wrong alignment on UUIController_101191");
static_assert(sizeof(UUIController_101191) == 0x000D78, "Wrong size on UUIController_101191");
static_assert(offsetof(UUIController_101191, LoopSetChargePerTimerHandle) == 0x000C58, "Member 'UUIController_101191::LoopSetChargePerTimerHandle' has a wrong offset!");
static_assert(offsetof(UUIController_101191, HintData) == 0x000C70, "Member 'UUIController_101191::HintData' has a wrong offset!");
static_assert(offsetof(UUIController_101191, WidgetAbilityEnergyRight) == 0x000D08, "Member 'UUIController_101191::WidgetAbilityEnergyRight' has a wrong offset!");
static_assert(offsetof(UUIController_101191, HulkBannerChar) == 0x000D10, "Member 'UUIController_101191::HulkBannerChar' has a wrong offset!");
static_assert(offsetof(UUIController_101191, MoveLogic) == 0x000D18, "Member 'UUIController_101191::MoveLogic' has a wrong offset!");
static_assert(offsetof(UUIController_101191, MinChargeHulk) == 0x000D20, "Member 'UUIController_101191::MinChargeHulk' has a wrong offset!");
static_assert(offsetof(UUIController_101191, MaxChargeHulk) == 0x000D24, "Member 'UUIController_101191::MaxChargeHulk' has a wrong offset!");
static_assert(offsetof(UUIController_101191, MinChargeMonster) == 0x000D28, "Member 'UUIController_101191::MinChargeMonster' has a wrong offset!");
static_assert(offsetof(UUIController_101191, MaxChargeMonster) == 0x000D2C, "Member 'UUIController_101191::MaxChargeMonster' has a wrong offset!");
static_assert(offsetof(UUIController_101191, Ability101191) == 0x000D30, "Member 'UUIController_101191::Ability101191' has a wrong offset!");
static_assert(offsetof(UUIController_101191, Ability101193) == 0x000D38, "Member 'UUIController_101191::Ability101193' has a wrong offset!");
static_assert(offsetof(UUIController_101191, bIsCharge) == 0x000D40, "Member 'UUIController_101191::bIsCharge' has a wrong offset!");
static_assert(offsetof(UUIController_101191, bIsClimbing) == 0x000D41, "Member 'UUIController_101191::bIsClimbing' has a wrong offset!");
static_assert(offsetof(UUIController_101191, bIsHanging) == 0x000D42, "Member 'UUIController_101191::bIsHanging' has a wrong offset!");
static_assert(offsetof(UUIController_101191, bHasShowHint) == 0x000D43, "Member 'UUIController_101191::bHasShowHint' has a wrong offset!");
static_assert(offsetof(UUIController_101191, bHasInitHulkParam) == 0x000D44, "Member 'UUIController_101191::bHasInitHulkParam' has a wrong offset!");
static_assert(offsetof(UUIController_101191, bHasInitMonsterParam) == 0x000D45, "Member 'UUIController_101191::bHasInitMonsterParam' has a wrong offset!");
static_assert(offsetof(UUIController_101191, WidgetTipLeft) == 0x000D48, "Member 'UUIController_101191::WidgetTipLeft' has a wrong offset!");
static_assert(offsetof(UUIController_101191, WidgetTipRight) == 0x000D50, "Member 'UUIController_101191::WidgetTipRight' has a wrong offset!");
static_assert(offsetof(UUIController_101191, AbilityPanel) == 0x000D58, "Member 'UUIController_101191::AbilityPanel' has a wrong offset!");
static_assert(offsetof(UUIController_101191, LoopCheckTipsAndHintTimerHandle) == 0x000D60, "Member 'UUIController_101191::LoopCheckTipsAndHintTimerHandle' has a wrong offset!");

// Class Hero_1011.Cue_Ability_Loop_10119103
// 0x0088 (0x0E88 - 0x0E00)
class ACue_Ability_Loop_10119103 : public AMarvelCueNotify_Ability
{
public:
	bool                                          IsAuxiliaryLineOn;                                 // 0x0E00(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E01[0x3];                                      // 0x0E01(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PressedTimeInterpAlpha;                            // 0x0E04(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LastSegmentLength;                                 // 0x0E08(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxJumpSeconds;                                    // 0x0E0C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxJumpHeightDown;                                 // 0x0E10(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxNumOfSplineMeshUsed;                            // 0x0E14(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            TailStaticMesh;                                    // 0x0E18(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            BodyStaticMesh;                                    // 0x0E20(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            HeadStaticMesh;                                    // 0x0E28(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStartFromCapsuleBottom;                           // 0x0E30(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E31[0x3];                                      // 0x0E31(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AbilityID;                                         // 0x0E34(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraComponent*                      NS_Gathering;                                      // 0x0E38(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMarvelSplineComponent*                 SplineComponent;                                   // 0x0E40(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USplineMeshComponent*>           SplineMeshCollection;                              // 0x0E48(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class UAbility_101191*                        OwnerAbility;                                      // 0x0E58(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AHulkBannerCharacter*                   OwnerCharacter;                                    // 0x0E60(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHulkBannerMoveLogicBaseComponent*      MoveLogicComponent;                                // 0x0E68(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            SpeedCurve;                                        // 0x0E70(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PressedSecondsMin;                                 // 0x0E78(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E7C[0xC];                                      // 0x0E7C(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnPressRelease(float TimeWaited);
	void OnPressTimeMin(float TimeWaited);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Cue_Ability_Loop_10119103">();
	}
	static class ACue_Ability_Loop_10119103* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACue_Ability_Loop_10119103>();
	}
};
static_assert(alignof(ACue_Ability_Loop_10119103) == 0x000008, "Wrong alignment on ACue_Ability_Loop_10119103");
static_assert(sizeof(ACue_Ability_Loop_10119103) == 0x000E88, "Wrong size on ACue_Ability_Loop_10119103");
static_assert(offsetof(ACue_Ability_Loop_10119103, IsAuxiliaryLineOn) == 0x000E00, "Member 'ACue_Ability_Loop_10119103::IsAuxiliaryLineOn' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_10119103, PressedTimeInterpAlpha) == 0x000E04, "Member 'ACue_Ability_Loop_10119103::PressedTimeInterpAlpha' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_10119103, LastSegmentLength) == 0x000E08, "Member 'ACue_Ability_Loop_10119103::LastSegmentLength' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_10119103, MaxJumpSeconds) == 0x000E0C, "Member 'ACue_Ability_Loop_10119103::MaxJumpSeconds' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_10119103, MaxJumpHeightDown) == 0x000E10, "Member 'ACue_Ability_Loop_10119103::MaxJumpHeightDown' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_10119103, MaxNumOfSplineMeshUsed) == 0x000E14, "Member 'ACue_Ability_Loop_10119103::MaxNumOfSplineMeshUsed' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_10119103, TailStaticMesh) == 0x000E18, "Member 'ACue_Ability_Loop_10119103::TailStaticMesh' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_10119103, BodyStaticMesh) == 0x000E20, "Member 'ACue_Ability_Loop_10119103::BodyStaticMesh' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_10119103, HeadStaticMesh) == 0x000E28, "Member 'ACue_Ability_Loop_10119103::HeadStaticMesh' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_10119103, bStartFromCapsuleBottom) == 0x000E30, "Member 'ACue_Ability_Loop_10119103::bStartFromCapsuleBottom' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_10119103, AbilityID) == 0x000E34, "Member 'ACue_Ability_Loop_10119103::AbilityID' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_10119103, NS_Gathering) == 0x000E38, "Member 'ACue_Ability_Loop_10119103::NS_Gathering' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_10119103, SplineComponent) == 0x000E40, "Member 'ACue_Ability_Loop_10119103::SplineComponent' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_10119103, SplineMeshCollection) == 0x000E48, "Member 'ACue_Ability_Loop_10119103::SplineMeshCollection' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_10119103, OwnerAbility) == 0x000E58, "Member 'ACue_Ability_Loop_10119103::OwnerAbility' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_10119103, OwnerCharacter) == 0x000E60, "Member 'ACue_Ability_Loop_10119103::OwnerCharacter' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_10119103, MoveLogicComponent) == 0x000E68, "Member 'ACue_Ability_Loop_10119103::MoveLogicComponent' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_10119103, SpeedCurve) == 0x000E70, "Member 'ACue_Ability_Loop_10119103::SpeedCurve' has a wrong offset!");
static_assert(offsetof(ACue_Ability_Loop_10119103, PressedSecondsMin) == 0x000E78, "Member 'ACue_Ability_Loop_10119103::PressedSecondsMin' has a wrong offset!");

// Class Hero_1011.MovableSplineMeshComponent
// 0x0000 (0x0A20 - 0x0A20)
class UMovableSplineMeshComponent final : public USplineMeshComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovableSplineMeshComponent">();
	}
	static class UMovableSplineMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovableSplineMeshComponent>();
	}
};
static_assert(alignof(UMovableSplineMeshComponent) == 0x000010, "Wrong alignment on UMovableSplineMeshComponent");
static_assert(sizeof(UMovableSplineMeshComponent) == 0x000A20, "Wrong size on UMovableSplineMeshComponent");

// Class Hero_1011.ConfigHulkClimb
// 0x0018 (0x00B0 - 0x0098)
class UConfigHulkClimb final : public UMarvelAbilityConfig
{
public:
	struct FHulkClimbParam                        ClimbParam;                                        // 0x0098(0x0010)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ServerWaitCollisionTime;                           // 0x00A8(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ConfigHulkClimb">();
	}
	static class UConfigHulkClimb* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConfigHulkClimb>();
	}
};
static_assert(alignof(UConfigHulkClimb) == 0x000008, "Wrong alignment on UConfigHulkClimb");
static_assert(sizeof(UConfigHulkClimb) == 0x0000B0, "Wrong size on UConfigHulkClimb");
static_assert(offsetof(UConfigHulkClimb, ClimbParam) == 0x000098, "Member 'UConfigHulkClimb::ClimbParam' has a wrong offset!");
static_assert(offsetof(UConfigHulkClimb, ServerWaitCollisionTime) == 0x0000A8, "Member 'UConfigHulkClimb::ServerWaitCollisionTime' has a wrong offset!");

// Class Hero_1011.Ability_101192
// 0x0120 (0x2670 - 0x2550)
class UAbility_101192 : public UMarvelGameplayAbility
{
public:
