#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Landscape

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "Landscape_structs.hpp"


namespace SDK
{

// Class Landscape.LandscapeGizmoActor
// 0x0000 (0x0470 - 0x0470)
class ALandscapeGizmoActor : public AActor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LandscapeGizmoActor">();
	}
	static class ALandscapeGizmoActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALandscapeGizmoActor>();
	}
};
static_assert(alignof(ALandscapeGizmoActor) == 0x000008, "Wrong alignment on ALandscapeGizmoActor");
static_assert(sizeof(ALandscapeGizmoActor) == 0x000470, "Wrong size on ALandscapeGizmoActor");

// Class Landscape.LandscapeGizmoActiveActor
// 0x0050 (0x04C0 - 0x0470)
class ALandscapeGizmoActiveActor final : public ALandscapeGizmoActor
{
public:
	uint8                                         Pad_470[0x50];                                     // 0x0470(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LandscapeGizmoActiveActor">();
	}
	static class ALandscapeGizmoActiveActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALandscapeGizmoActiveActor>();
	}
};
static_assert(alignof(ALandscapeGizmoActiveActor) == 0x000008, "Wrong alignment on ALandscapeGizmoActiveActor");
static_assert(sizeof(ALandscapeGizmoActiveActor) == 0x0004C0, "Wrong size on ALandscapeGizmoActiveActor");

// Class Landscape.ControlPointMeshComponent
// 0x0000 (0x0920 - 0x0920)
class UControlPointMeshComponent final : public UStaticMeshComponent
{
public:
	float                                         VirtualTextureMainPassMaxDrawDistance;             // 0x0918(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91C[0x4];                                      // 0x091C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ControlPointMeshComponent">();
	}
	static class UControlPointMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UControlPointMeshComponent>();
	}
};
static_assert(alignof(UControlPointMeshComponent) == 0x000010, "Wrong alignment on UControlPointMeshComponent");
static_assert(sizeof(UControlPointMeshComponent) == 0x000920, "Wrong size on UControlPointMeshComponent");
static_assert(offsetof(UControlPointMeshComponent, VirtualTextureMainPassMaxDrawDistance) == 0x000918, "Member 'UControlPointMeshComponent::VirtualTextureMainPassMaxDrawDistance' has a wrong offset!");

// Class Landscape.LandscapeSplineInterface
// 0x0000 (0x0030 - 0x0030)
class ILandscapeSplineInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LandscapeSplineInterface">();
	}
	static class ILandscapeSplineInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ILandscapeSplineInterface>();
	}
};
static_assert(alignof(ILandscapeSplineInterface) == 0x000008, "Wrong alignment on ILandscapeSplineInterface");
static_assert(sizeof(ILandscapeSplineInterface) == 0x000030, "Wrong size on ILandscapeSplineInterface");

// Class Landscape.MaterialExpressionLandscapePhysicalMaterialOutput
// 0x0010 (0x00C8 - 0x00B8)
class UMaterialExpressionLandscapePhysicalMaterialOutput final : public UMaterialExpressionCustomOutput
{
public:
	TArray<struct FPhysicalMaterialInput>         Inputs;                                            // 0x00B8(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MaterialExpressionLandscapePhysicalMaterialOutput">();
	}
	static class UMaterialExpressionLandscapePhysicalMaterialOutput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionLandscapePhysicalMaterialOutput>();
	}
};
static_assert(alignof(UMaterialExpressionLandscapePhysicalMaterialOutput) == 0x000008, "Wrong alignment on UMaterialExpressionLandscapePhysicalMaterialOutput");
static_assert(sizeof(UMaterialExpressionLandscapePhysicalMaterialOutput) == 0x0000C8, "Wrong size on UMaterialExpressionLandscapePhysicalMaterialOutput");
static_assert(offsetof(UMaterialExpressionLandscapePhysicalMaterialOutput, Inputs) == 0x0000B8, "Member 'UMaterialExpressionLandscapePhysicalMaterialOutput::Inputs' has a wrong offset!");

// Class Landscape.LandscapeProxy
// 0x03A8 (0x0818 - 0x0470)
class ALandscapeProxy : public APartitionActor
{
public:
	uint8                                         Pad_470[0x8];                                      // 0x0470(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class ULandscapeSplinesComponent*             SplineComponent;                                   // 0x0478(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  LandscapeGuid;                                     // 0x0480(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_490[0x10];                                     // 0x0490(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bEnableNanite;                                     // 0x04A0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4A1[0x7];                                      // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLandscapePerLODMaterialOverride> PerLODOverrideMaterials;                           // 0x04A8(0x0010)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FIntPoint                              LandscapeSectionOffset;                            // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxLODLevel;                                       // 0x04C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ComponentScreenSizeToUseSubSections;               // 0x04C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LOD0ScreenSize;                                    // 0x04C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        LODGroupKey;                                       // 0x04CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LOD0DistributionSetting;                           // 0x04D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LODDistributionSetting;                            // 0x04D4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StaticLightingLOD;                                 // 0x04D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4DC[0x4];                                      // 0x04DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      DefaultPhysMaterial;                               // 0x04E0(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StreamingDistanceMultiplier;                       // 0x04E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4EC[0x4];                                      // 0x04EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     LandscapeMaterial;                                 // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4F8[0x20];                                     // 0x04F8(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     LandscapeHoleMaterial;                             // 0x0518(0x0008)(Edit, ZeroConstructor, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class URuntimeVirtualTexture*>         RuntimeVirtualTextures;                            // 0x0520(0x0010)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                          bSetCreateRuntimeVirtualTextureVolumes;            // 0x0530(0x0001)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVirtualTextureRenderWithQuad;                     // 0x0531(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVirtualTextureRenderWithQuadHQ;                   // 0x0532(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_533[0x1];                                      // 0x0533(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         VirtualTextureNumLods;                             // 0x0534(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VirtualTextureLodBias;                             // 0x0538(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERuntimeVirtualTextureMainPassType            VirtualTextureRenderPassType;                      // 0x053C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_53D[0x3];                                      // 0x053D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         NegativeZBoundsExtension;                          // 0x0540(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PositiveZBoundsExtension;                          // 0x0544(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ULandscapeComponent*>            LandscapeComponents;                               // 0x0548(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class ULandscapeHeightfieldCollisionComponent*> CollisionComponents;                               // 0x0558(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UHierarchicalInstancedStaticMeshComponent*> FoliageComponents;                                 // 0x0568(0x0010)(ExportObject, ZeroConstructor, Transient, DuplicateTransient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	class ULandscapeNaniteComponent*              NaniteComponent;                                   // 0x0578(0x0008)(ExportObject, ZeroConstructor, InstancedReference, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ULandscapeNaniteComponent*>      NaniteComponents;                                  // 0x0580(0x0010)(ExportObject, ZeroConstructor, NonTransactional, ContainsInstancedReference, TextExportTransient, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_590[0x64];                                     // 0x0590(0x0064)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bHasLandscapeGrass;                                // 0x05F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5F5[0x3];                                      // 0x05F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StaticLightingResolution;                          // 0x05F8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         CastShadow : 1;                                    // 0x05FC(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCastDynamicShadow : 1;                            // 0x05FC(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCastStaticShadow : 1;                             // 0x05FC(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	EShadowCacheInvalidationBehavior              ShadowCacheInvalidationBehavior;                   // 0x05FD(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bCastContactShadow : 1;                            // 0x05FE(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         BitPad_5FE_1 : 7;                                  // 0x05FE(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         Pad_5FF[0x1];                                      // 0x05FF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bCastFarShadow : 1;                                // 0x0600(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         BitPad_600_1 : 7;                                  // 0x0600(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         Pad_601[0x3];                                      // 0x0601(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bCastHiddenShadow : 1;                             // 0x0604(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         BitPad_604_1 : 7;                                  // 0x0604(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         Pad_605[0x3];                                      // 0x0605(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bCastShadowAsTwoSided : 1;                         // 0x0608(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         BitPad_608_1 : 7;                                  // 0x0608(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         Pad_609[0x3];                                      // 0x0609(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bAffectDistanceFieldLighting : 1;                  // 0x060C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	struct FLightingChannels                      LightingChannels;                                  // 0x060D(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	uint8                                         Pad_60E[0x2];                                      // 0x060E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bUseMaterialPositionOffsetInStaticLighting : 1;    // 0x0610(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bRenderCustomDepth : 1;                            // 0x0610(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_611[0x3];                                      // 0x0611(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	ERendererStencilMask                          CustomDepthStencilWriteMask;                       // 0x0614(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_615[0x3];                                      // 0x0615(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CustomDepthStencilValue;                           // 0x0618(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LDMaxDrawDistance;                                 // 0x061C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLightmassPrimitiveSettings            LightmassSettings;                                 // 0x0620(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         CollisionMipLevel;                                 // 0x0638(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SimpleCollisionMipLevel;                           // 0x063C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_640[0x8];                                      // 0x0640(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBodyInstance                          BodyInstance;                                      // 0x0648(0x01B0)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	uint8                                         bGenerateOverlapEvents : 1;                        // 0x07F8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bBakeMaterialPositionOffsetIntoCollision : 1;      // 0x07F8(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_7F9[0x3];                                      // 0x07F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ComponentSizeQuads;                                // 0x07FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SubsectionSizeQuads;                               // 0x0800(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumSubsections;                                    // 0x0804(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bUsedForNavigation : 1;                            // 0x0808(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bFillCollisionUnderLandscapeForNavmesh : 1;        // 0x0808(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_809[0x3];                                      // 0x0809(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	ENavDataGatheringMode                         NavigationGeometryGatheringMode;                   // 0x080C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseDynamicMaterialInstance;                       // 0x080D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseLandscapeForCullingInvisibleHLODVertices;      // 0x080E(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasLayersContent;                                 // 0x080F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseCompressedHeightmapStorage;                    // 0x0810(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_811[0x7];                                      // 0x0811(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ChangeComponentScreenSizeToUseSubSections(float InComponentScreenSizeToUseSubSections);
	void ChangeLODDistanceFactor(float InLODDistanceFactor);
	void EditorApplySpline(class USplineComponent* InSplineComponent, float StartWidth, float EndWidth, float StartSideFalloff, float EndSideFalloff, float StartRoll, float EndRoll, int32 NumSubdivisions, bool bRaiseHeights, bool bLowerHeights, class ULandscapeLayerInfoObject* PaintLayer, class FName EditLayerName);
	void EditorSetLandscapeMaterial(class UMaterialInterface* NewLandscapeMaterial);
	class ALandscape* GetLandscapeActor();
	bool LandscapeExportHeightmapToRenderTarget(class UTextureRenderTarget2D* InRenderTarget, bool InExportHeightIntoRGChannel, bool InExportLandscapeProxies);
	void SetLandscapeMaterialScalarParameterValue(class FName ParameterName, float Value);
	void SetLandscapeMaterialTextureParameterValue(class FName ParameterName, class UTexture* Value);
	void SetLandscapeMaterialVectorParameterValue(class FName ParameterName, const struct FLinearColor& Value);
	void SetVirtualTextureRenderPassType(ERuntimeVirtualTextureMainPassType InType);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LandscapeProxy">();
	}
	static class ALandscapeProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALandscapeProxy>();
	}
};
static_assert(alignof(ALandscapeProxy) == 0x000008, "Wrong alignment on ALandscapeProxy");
static_assert(sizeof(ALandscapeProxy) == 0x000818, "Wrong size on ALandscapeProxy");
static_assert(offsetof(ALandscapeProxy, SplineComponent) == 0x000478, "Member 'ALandscapeProxy::SplineComponent' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, LandscapeGuid) == 0x000480, "Member 'ALandscapeProxy::LandscapeGuid' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, bEnableNanite) == 0x0004A0, "Member 'ALandscapeProxy::bEnableNanite' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, PerLODOverrideMaterials) == 0x0004A8, "Member 'ALandscapeProxy::PerLODOverrideMaterials' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, LandscapeSectionOffset) == 0x0004B8, "Member 'ALandscapeProxy::LandscapeSectionOffset' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, MaxLODLevel) == 0x0004C0, "Member 'ALandscapeProxy::MaxLODLevel' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, ComponentScreenSizeToUseSubSections) == 0x0004C4, "Member 'ALandscapeProxy::ComponentScreenSizeToUseSubSections' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, LOD0ScreenSize) == 0x0004C8, "Member 'ALandscapeProxy::LOD0ScreenSize' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, LODGroupKey) == 0x0004CC, "Member 'ALandscapeProxy::LODGroupKey' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, LOD0DistributionSetting) == 0x0004D0, "Member 'ALandscapeProxy::LOD0DistributionSetting' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, LODDistributionSetting) == 0x0004D4, "Member 'ALandscapeProxy::LODDistributionSetting' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, StaticLightingLOD) == 0x0004D8, "Member 'ALandscapeProxy::StaticLightingLOD' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, DefaultPhysMaterial) == 0x0004E0, "Member 'ALandscapeProxy::DefaultPhysMaterial' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, StreamingDistanceMultiplier) == 0x0004E8, "Member 'ALandscapeProxy::StreamingDistanceMultiplier' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, LandscapeMaterial) == 0x0004F0, "Member 'ALandscapeProxy::LandscapeMaterial' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, LandscapeHoleMaterial) == 0x000518, "Member 'ALandscapeProxy::LandscapeHoleMaterial' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, RuntimeVirtualTextures) == 0x000520, "Member 'ALandscapeProxy::RuntimeVirtualTextures' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, bSetCreateRuntimeVirtualTextureVolumes) == 0x000530, "Member 'ALandscapeProxy::bSetCreateRuntimeVirtualTextureVolumes' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, bVirtualTextureRenderWithQuad) == 0x000531, "Member 'ALandscapeProxy::bVirtualTextureRenderWithQuad' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, bVirtualTextureRenderWithQuadHQ) == 0x000532, "Member 'ALandscapeProxy::bVirtualTextureRenderWithQuadHQ' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, VirtualTextureNumLods) == 0x000534, "Member 'ALandscapeProxy::VirtualTextureNumLods' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, VirtualTextureLodBias) == 0x000538, "Member 'ALandscapeProxy::VirtualTextureLodBias' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, VirtualTextureRenderPassType) == 0x00053C, "Member 'ALandscapeProxy::VirtualTextureRenderPassType' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, NegativeZBoundsExtension) == 0x000540, "Member 'ALandscapeProxy::NegativeZBoundsExtension' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, PositiveZBoundsExtension) == 0x000544, "Member 'ALandscapeProxy::PositiveZBoundsExtension' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, LandscapeComponents) == 0x000548, "Member 'ALandscapeProxy::LandscapeComponents' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, CollisionComponents) == 0x000558, "Member 'ALandscapeProxy::CollisionComponents' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, FoliageComponents) == 0x000568, "Member 'ALandscapeProxy::FoliageComponents' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, NaniteComponent) == 0x000578, "Member 'ALandscapeProxy::NaniteComponent' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, NaniteComponents) == 0x000580, "Member 'ALandscapeProxy::NaniteComponents' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, bHasLandscapeGrass) == 0x0005F4, "Member 'ALandscapeProxy::bHasLandscapeGrass' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, StaticLightingResolution) == 0x0005F8, "Member 'ALandscapeProxy::StaticLightingResolution' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, ShadowCacheInvalidationBehavior) == 0x0005FD, "Member 'ALandscapeProxy::ShadowCacheInvalidationBehavior' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, LightingChannels) == 0x00060D, "Member 'ALandscapeProxy::LightingChannels' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, CustomDepthStencilWriteMask) == 0x000614, "Member 'ALandscapeProxy::CustomDepthStencilWriteMask' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, CustomDepthStencilValue) == 0x000618, "Member 'ALandscapeProxy::CustomDepthStencilValue' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, LDMaxDrawDistance) == 0x00061C, "Member 'ALandscapeProxy::LDMaxDrawDistance' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, LightmassSettings) == 0x000620, "Member 'ALandscapeProxy::LightmassSettings' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, CollisionMipLevel) == 0x000638, "Member 'ALandscapeProxy::CollisionMipLevel' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, SimpleCollisionMipLevel) == 0x00063C, "Member 'ALandscapeProxy::SimpleCollisionMipLevel' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, BodyInstance) == 0x000648, "Member 'ALandscapeProxy::BodyInstance' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, ComponentSizeQuads) == 0x0007FC, "Member 'ALandscapeProxy::ComponentSizeQuads' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, SubsectionSizeQuads) == 0x000800, "Member 'ALandscapeProxy::SubsectionSizeQuads' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, NumSubsections) == 0x000804, "Member 'ALandscapeProxy::NumSubsections' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, NavigationGeometryGatheringMode) == 0x00080C, "Member 'ALandscapeProxy::NavigationGeometryGatheringMode' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, bUseDynamicMaterialInstance) == 0x00080D, "Member 'ALandscapeProxy::bUseDynamicMaterialInstance' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, bUseLandscapeForCullingInvisibleHLODVertices) == 0x00080E, "Member 'ALandscapeProxy::bUseLandscapeForCullingInvisibleHLODVertices' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, bHasLayersContent) == 0x00080F, "Member 'ALandscapeProxy::bHasLayersContent' has a wrong offset!");
static_assert(offsetof(ALandscapeProxy, bUseCompressedHeightmapStorage) == 0x000810, "Member 'ALandscapeProxy::bUseCompressedHeightmapStorage' has a wrong offset!");

// Class Landscape.LandscapeMeshProxyActor
// 0x0008 (0x0478 - 0x0470)
class ALandscapeMeshProxyActor final : public AActor
{
public:
	class ULandscapeMeshProxyComponent*           LandscapeMeshProxyComponent;                       // 0x0470(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LandscapeMeshProxyActor">();
	}
	static class ALandscapeMeshProxyActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALandscapeMeshProxyActor>();
	}
};
static_assert(alignof(ALandscapeMeshProxyActor) == 0x000008, "Wrong alignment on ALandscapeMeshProxyActor");
static_assert(sizeof(ALandscapeMeshProxyActor) == 0x000478, "Wrong size on ALandscapeMeshProxyActor");
static_assert(offsetof(ALandscapeMeshProxyActor, LandscapeMeshProxyComponent) == 0x000470, "Member 'ALandscapeMeshProxyActor::LandscapeMeshProxyComponent' has a wrong offset!");

// Class Landscape.Landscape
// 0x0000 (0x0818 - 0x0818)
class ALandscape final : public ALandscapeProxy
{
public:
	void RenderHeightmap(const struct FTransform& InWorldTransform, const struct FBox2D& InExtents, class UTextureRenderTarget2D* OutRenderTarget);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Landscape">();
	}
	static class ALandscape* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALandscape>();
	}
};
static_assert(alignof(ALandscape) == 0x000008, "Wrong alignment on ALandscape");
static_assert(sizeof(ALandscape) == 0x000818, "Wrong size on ALandscape");

// Class Landscape.LandscapeLayerInfoObject
// 0x0030 (0x0060 - 0x0030)
class ULandscapeLayerInfoObject final : public UObject
{
public:
	class FName                                   LayerName;                                         // 0x0030(0x000C)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      PhysMaterial;                                      // 0x0040(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Hardness;                                          // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           LayerUsageDebugColor;                              // 0x004C(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LandscapeLayerInfoObject">();
	}
	static class ULandscapeLayerInfoObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULandscapeLayerInfoObject>();
	}
};
static_assert(alignof(ULandscapeLayerInfoObject) == 0x000008, "Wrong alignment on ULandscapeLayerInfoObject");
static_assert(sizeof(ULandscapeLayerInfoObject) == 0x000060, "Wrong size on ULandscapeLayerInfoObject");
static_assert(offsetof(ULandscapeLayerInfoObject, LayerName) == 0x000030, "Member 'ULandscapeLayerInfoObject::LayerName' has a wrong offset!");
static_assert(offsetof(ULandscapeLayerInfoObject, PhysMaterial) == 0x000040, "Member 'ULandscapeLayerInfoObject::PhysMaterial' has a wrong offset!");
static_assert(offsetof(ULandscapeLayerInfoObject, Hardness) == 0x000048, "Member 'ULandscapeLayerInfoObject::Hardness' has a wrong offset!");
static_assert(offsetof(ULandscapeLayerInfoObject, LayerUsageDebugColor) == 0x00004C, "Member 'ULandscapeLayerInfoObject::LayerUsageDebugColor' has a wrong offset!");

// Class Landscape.LandscapeLODStreamingProxy_DEPRECATED
// 0x0000 (0x00E0 - 0x00E0)
class ULandscapeLODStreamingProxy_DEPRECATED final : public UStreamableRenderAsset
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LandscapeLODStreamingProxy_DEPRECATED">();
	}
	static class ULandscapeLODStreamingProxy_DEPRECATED* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULandscapeLODStreamingProxy_DEPRECATED>();
	}
};
static_assert(alignof(ULandscapeLODStreamingProxy_DEPRECATED) == 0x000008, "Wrong alignment on ULandscapeLODStreamingProxy_DEPRECATED");
static_assert(sizeof(ULandscapeLODStreamingProxy_DEPRECATED) == 0x0000E0, "Wrong size on ULandscapeLODStreamingProxy_DEPRECATED");

// Class Landscape.LandscapeComponent
// 0x01F0 (0x0A10 - 0x0820)
class ULandscapeComponent final : public UPrimitiveComponent
{
public:
	int32                                         SectionBaseX;                                      // 0x0820(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SectionBaseY;                                      // 0x0824(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ComponentSizeQuads;                                // 0x0828(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SubsectionSizeQuads;                               // 0x082C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumSubsections;                                    // 0x0830(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_834[0x4];                                      // 0x0834(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     OverrideMaterial;                                  // 0x0838(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     OverrideHoleMaterial;                              // 0x0840(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMaterialInstanceConstant*>      MaterialInstances;                                 // 0x0848(0x0010)(ZeroConstructor, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UMaterialInstanceDynamic*>       MaterialInstancesDynamic;                          // 0x0858(0x0010)(ZeroConstructor, Transient, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<int8>                                  LODIndexToMaterialIndex;                           // 0x0868(0x0010)(ZeroConstructor, TextExportTransient, NativeAccessSpecifierPublic)
	class UTexture2D*                             XYOffsetmapTexture;                                // 0x0878(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector4                               WeightmapScaleBias;                                // 0x0880(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WeightmapSubsectionOffset;                         // 0x08A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8A4[0xC];                                      // 0x08A4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               HeightmapScaleBias;                                // 0x08B0(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBox                                   CachedLocalBox;                                    // 0x08D0(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class ULandscapeHeightfieldCollisionComponent* CollisionComponentRef;                             // 0x0908(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bUserTriggeredChangeRequested;                     // 0x0910(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bNaniteActive;                                     // 0x0911(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_912[0x6];                                      // 0x0912(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             HeightmapTexture;                                  // 0x0918(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FWeightmapLayerAllocationInfo>  WeightmapLayerAllocations;                         // 0x0920(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class UTexture2D*>                     WeightmapTextures;                                 // 0x0930(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<struct FLandscapePerLODMaterialOverride> PerLODOverrideMaterials;                           // 0x0940(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FGuid                                  MapBuildDataId;                                    // 0x0950(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CollisionMipLevel;                                 // 0x0960(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SimpleCollisionMipLevel;                           // 0x0964(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NegativeZBoundsExtension;                          // 0x0968(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PositiveZBoundsExtension;                          // 0x096C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StaticLightingResolution;                          // 0x0970(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ForcedLOD;                                         // 0x0974(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LODBias;                                           // 0x0978(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  StateId;                                           // 0x097C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_98C[0x24];                                     // 0x098C(0x0024)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     MobileMaterialInterface;                           // 0x09B0(0x0008)(ZeroConstructor, Deprecated, NoDestructor, NonPIEDuplicateTransient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMaterialInterface*>             MobileMaterialInterfaces;                          // 0x09B8(0x0010)(ZeroConstructor, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UTexture2D*>                     MobileWeightmapTextures;                           // 0x09C8(0x0010)(ZeroConstructor, NonPIEDuplicateTransient, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<struct FWeightmapLayerAllocationInfo>  MobileWeightmapLayerAllocations;                   // 0x09D8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_9E8[0x28];                                     // 0x09E8(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float EditorGetPaintLayerWeightAtLocation(const struct FVector& InLocation, class ULandscapeLayerInfoObject* PaintLayer);
	float EditorGetPaintLayerWeightByNameAtLocation(const struct FVector& InLocation, const class FName InPaintLayerName);
	void SetForcedLOD(int32 InForcedLOD);
	void SetLODBias(int32 InLODBias);

	class UMaterialInstanceDynamic* GetMaterialInstanceDynamic(int32 InIndex) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LandscapeComponent">();
	}
	static class ULandscapeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULandscapeComponent>();
	}
};
static_assert(alignof(ULandscapeComponent) == 0x000010, "Wrong alignment on ULandscapeComponent");
static_assert(sizeof(ULandscapeComponent) == 0x000A10, "Wrong size on ULandscapeComponent");
static_assert(offsetof(ULandscapeComponent, SectionBaseX) == 0x000820, "Member 'ULandscapeComponent::SectionBaseX' has a wrong offset!");
static_assert(offsetof(ULandscapeComponent, SectionBaseY) == 0x000824, "Member 'ULandscapeComponent::SectionBaseY' has a wrong offset!");
static_assert(offsetof(ULandscapeComponent, ComponentSizeQuads) == 0x000828, "Member 'ULandscapeComponent::ComponentSizeQuads' has a wrong offset!");
static_assert(offsetof(ULandscapeComponent, SubsectionSizeQuads) == 0x00082C, "Member 'ULandscapeComponent::SubsectionSizeQuads' has a wrong offset!");
static_assert(offsetof(ULandscapeComponent, NumSubsections) == 0x000830, "Member 'ULandscapeComponent::NumSubsections' has a wrong offset!");
static_assert(offsetof(ULandscapeComponent, OverrideMaterial) == 0x000838, "Member 'ULandscapeComponent::OverrideMaterial' has a wrong offset!");
static_assert(offsetof(ULandscapeComponent, OverrideHoleMaterial) == 0x000840, "Member 'ULandscapeComponent::OverrideHoleMaterial' has a wrong offset!");
static_assert(offsetof(ULandscapeComponent, MaterialInstances) == 0x000848, "Member 'ULandscapeComponent::MaterialInstances' has a wrong offset!");
static_assert(offsetof(ULandscapeComponent, MaterialInstancesDynamic) == 0x000858, "Member 'ULandscapeComponent::MaterialInstancesDynamic' has a wrong offset!");
static_assert(offsetof(ULandscapeComponent, LODIndexToMaterialIndex) == 0x000868, "Member 'ULandscapeComponent::LODIndexToMaterialIndex' has a wrong offset!");
static_assert(offsetof(ULandscapeComponent, XYOffsetmapTexture) == 0x000878, "Member 'ULandscapeComponent::XYOffsetmapTexture' has a wrong offset!");
static_assert(offsetof(ULandscapeComponent, WeightmapScaleBias) == 0x000880, "Member 'ULandscapeComponent::WeightmapScaleBias' has a wrong offset!");
static_assert(offsetof(ULandscapeComponent, WeightmapSubsectionOffset) == 0x0008A0, "Member 'ULandscapeComponent::WeightmapSubsectionOffset' has a wrong offset!");
static_assert(offsetof(ULandscapeComponent, HeightmapScaleBias) == 0x0008B0, "Member 'ULandscapeComponent::HeightmapScaleBias' has a wrong offset!");
static_assert(offsetof(ULandscapeComponent, CachedLocalBox) == 0x0008D0, "Member 'ULandscapeComponent::CachedLocalBox' has a wrong offset!");
static_assert(offsetof(ULandscapeComponent, CollisionComponentRef) == 0x000908, "Member 'ULandscapeComponent::CollisionComponentRef' has a wrong offset!");
static_assert(offsetof(ULandscapeComponent, bUserTriggeredChangeRequested) == 0x000910, "Member 'ULandscapeComponent::bUserTriggeredChangeRequested' has a wrong offset!");
static_assert(offsetof(ULandscapeComponent, bNaniteActive) == 0x000911, "Member 'ULandscapeComponent::bNaniteActive' has a wrong offset!");
static_assert(offsetof(ULandscapeComponent, HeightmapTexture) == 0x000918, "Member 'ULandscapeComponent::HeightmapTexture' has a wrong offset!");
static_assert(offsetof(ULandscapeComponent, WeightmapLayerAllocations) == 0x000920, "Member 'ULandscapeComponent::WeightmapLayerAllocations' has a wrong offset!");
static_assert(offsetof(ULandscapeComponent, WeightmapTextures) == 0x000930, "Member 'ULandscapeComponent::WeightmapTextures' has a wrong offset!");
static_assert(offsetof(ULandscapeComponent, PerLODOverrideMaterials) == 0x000940, "Member 'ULandscapeComponent::PerLODOverrideMaterials' has a wrong offset!");
static_assert(offsetof(ULandscapeComponent, MapBuildDataId) == 0x000950, "Member 'ULandscapeComponent::MapBuildDataId' has a wrong offset!");
static_assert(offsetof(ULandscapeComponent, CollisionMipLevel) == 0x000960, "Member 'ULandscapeComponent::CollisionMipLevel' has a wrong offset!");
static_assert(offsetof(ULandscapeComponent, SimpleCollisionMipLevel) == 0x000964, "Member 'ULandscapeComponent::SimpleCollisionMipLevel' has a wrong offset!");
static_assert(offsetof(ULandscapeComponent, NegativeZBoundsExtension) == 0x000968, "Member 'ULandscapeComponent::NegativeZBoundsExtension' has a wrong offset!");
static_assert(offsetof(ULandscapeComponent, PositiveZBoundsExtension) == 0x00096C, "Member 'ULandscapeComponent::PositiveZBoundsExtension' has a wrong offset!");
static_assert(offsetof(ULandscapeComponent, StaticLightingResolution) == 0x000970, "Member 'ULandscapeComponent::StaticLightingResolution' has a wrong offset!");
static_assert(offsetof(ULandscapeComponent, ForcedLOD) == 0x000974, "Member 'ULandscapeComponent::ForcedLOD' has a wrong offset!");
static_assert(offsetof(ULandscapeComponent, LODBias) == 0x000978, "Member 'ULandscapeComponent::LODBias' has a wrong offset!");
static_assert(offsetof(ULandscapeComponent, StateId) == 0x00097C, "Member 'ULandscapeComponent::StateId' has a wrong offset!");
static_assert(offsetof(ULandscapeComponent, MobileMaterialInterface) == 0x0009B0, "Member 'ULandscapeComponent::MobileMaterialInterface' has a wrong offset!");
static_assert(offsetof(ULandscapeComponent, MobileMaterialInterfaces) == 0x0009B8, "Member 'ULandscapeComponent::MobileMaterialInterfaces' has a wrong offset!");
static_assert(offsetof(ULandscapeComponent, MobileWeightmapTextures) == 0x0009C8, "Member 'ULandscapeComponent::MobileWeightmapTextures' has a wrong offset!");
static_assert(offsetof(ULandscapeComponent, MobileWeightmapLayerAllocations) == 0x0009D8, "Member 'ULandscapeComponent::MobileWeightmapLayerAllocations' has a wrong offset!");

// Class Landscape.LandscapeMaterialInstanceConstant
// 0x0018 (0x0298 - 0x0280)
class ULandscapeMaterialInstanceConstant final : public UMaterialInstanceConstant
{
public:
	TArray<struct FLandscapeMaterialTextureStreamingInfo> TextureStreamingInfo;                              // 0x0280(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         bIsLayerThumbnail : 1;                             // 0x0290(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bDisableTessellation : 1;                          // 0x0290(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bMobile : 1;                                       // 0x0290(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEditorToolUsage : 1;                              // 0x0290(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LandscapeMaterialInstanceConstant">();
	}
	static class ULandscapeMaterialInstanceConstant* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULandscapeMaterialInstanceConstant>();
	}
};
static_assert(alignof(ULandscapeMaterialInstanceConstant) == 0x000008, "Wrong alignment on ULandscapeMaterialInstanceConstant");
static_assert(sizeof(ULandscapeMaterialInstanceConstant) == 0x000298, "Wrong size on ULandscapeMaterialInstanceConstant");
static_assert(offsetof(ULandscapeMaterialInstanceConstant, TextureStreamingInfo) == 0x000280, "Member 'ULandscapeMaterialInstanceConstant::TextureStreamingInfo' has a wrong offset!");

// Class Landscape.LandscapeGizmoRenderComponent
// 0x0000 (0x0820 - 0x0820)
class ULandscapeGizmoRenderComponent final : public UPrimitiveComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LandscapeGizmoRenderComponent">();
	}
	static class ULandscapeGizmoRenderComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULandscapeGizmoRenderComponent>();
	}
};
static_assert(alignof(ULandscapeGizmoRenderComponent) == 0x000010, "Wrong alignment on ULandscapeGizmoRenderComponent");
static_assert(sizeof(ULandscapeGizmoRenderComponent) == 0x000820, "Wrong size on ULandscapeGizmoRenderComponent");

// Class Landscape.LandscapeGrassType
// 0x0038 (0x0068 - 0x0030)
class ULandscapeGrassType final : public UObject
{
public:
	TArray<struct FGrassVariety>                  GrassVarieties;                                    // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         bEnableDensityScaling : 1;                         // 0x0040(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            GrassMesh;                                         // 0x0048(0x0008)(ZeroConstructor, Deprecated, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GrassDensity;                                      // 0x0050(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlacementJitter;                                   // 0x0054(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StartCullDistance;                                 // 0x0058(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EndCullDistance;                                   // 0x005C(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          RandomRotation;                                    // 0x0060(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AlignToSurface;                                    // 0x0061(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LandscapeGrassType">();
	}
	static class ULandscapeGrassType* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULandscapeGrassType>();
	}
};
static_assert(alignof(ULandscapeGrassType) == 0x000008, "Wrong alignment on ULandscapeGrassType");
static_assert(sizeof(ULandscapeGrassType) == 0x000068, "Wrong size on ULandscapeGrassType");
static_assert(offsetof(ULandscapeGrassType, GrassVarieties) == 0x000030, "Member 'ULandscapeGrassType::GrassVarieties' has a wrong offset!");
static_assert(offsetof(ULandscapeGrassType, GrassMesh) == 0x000048, "Member 'ULandscapeGrassType::GrassMesh' has a wrong offset!");
static_assert(offsetof(ULandscapeGrassType, GrassDensity) == 0x000050, "Member 'ULandscapeGrassType::GrassDensity' has a wrong offset!");
static_assert(offsetof(ULandscapeGrassType, PlacementJitter) == 0x000054, "Member 'ULandscapeGrassType::PlacementJitter' has a wrong offset!");
static_assert(offsetof(ULandscapeGrassType, StartCullDistance) == 0x000058, "Member 'ULandscapeGrassType::StartCullDistance' has a wrong offset!");
static_assert(offsetof(ULandscapeGrassType, EndCullDistance) == 0x00005C, "Member 'ULandscapeGrassType::EndCullDistance' has a wrong offset!");
static_assert(offsetof(ULandscapeGrassType, RandomRotation) == 0x000060, "Member 'ULandscapeGrassType::RandomRotation' has a wrong offset!");
static_assert(offsetof(ULandscapeGrassType, AlignToSurface) == 0x000061, "Member 'ULandscapeGrassType::AlignToSurface' has a wrong offset!");

// Class Landscape.LandscapeHeightfieldCollisionComponent
// 0x00F0 (0x0910 - 0x0820)
#pragma pack(push, 0x1)
class alignas(0x10) ULandscapeHeightfieldCollisionComponent : public UPrimitiveComponent
{
public:
	TArray<class ULandscapeLayerInfoObject*>      ComponentLayerInfos;                               // 0x0820(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	int32                                         SectionBaseX;                                      // 0x0830(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SectionBaseY;                                      // 0x0834(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CollisionSizeQuads;                                // 0x0838(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CollisionScale;                                    // 0x083C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
